{"sentences": ["Alexa Terms of Use", "Last Updated: November 27, 2018", "This is an agreement between you and Amazon Digital Services LLC (with its affiliates, \"Amazon\" or \"we\").", "Before using Alexa, please read these Alexa Terms of Use, including the Alexa Communication Schedule, the Amazon.com Privacy Notice, the Amazon.com Conditions of Use, and the other applicable rules, policies, and terms posted on the Amazon.com website, available through your Alexa App, or provided with Alexa Enabled Products (collectively, this \"Agreement\").", "By using Alexa, you agree to be bound by the terms of this Agreement.", "If you do not accept the terms of this Agreement, then you may not use Alexa.", "For the purpose of these Alexa Terms of Use:", "\"Alexa\" means Amazon's Alexa voice services, which includes Third Party Services, digital content, Software, the Alexa App, and support and other related services.", "\"Alexa App\" means the app or website provided by Amazon that provides access to Alexa, Alexa's settings, Alexa-related content, and other information.", "\"Alexa Enabled Product\" means any product or application that enables access to Alexa, such as Amazon Echo devices and the Alexa App.", "“Alexa Interactions” means all information related to your use of Alexa and Alexa Enabled Products, including your voice and other inputs, responses provided to you through Alexa, information we receive in connection with Third Party Services and Auxiliary Products you use, and information and content you provide or receive through the Alexa App.", "“Auxiliary Product” means any product you can interact with or operate using an Alexa Enabled Product, including Alexa Gadgets and smart home devices such as lights, switches, and thermostats.", "\"Software\" means all software that we make available to you for use in connection with Alexa.", "\"Third Party Service\" means any service or application provided by a third party that we make available to you for use on or through Alexa.", "1.", "Alexa", "1.1.", "Alexa.", "An Alexa Enabled Product and internet connection are required to access and use Alexa.", "Some Alexa services may not be available in all areas or on all Alexa Enabled Products and may require separate subscriptions.", "1.2 Use of the Software.", "You may use the Software only on or through an Alexa Enabled Product or Auxiliary Product, and you may only make personal and non-commercial use of Alexa.", "For additional terms that apply to the Software, see the software terms contained in the Amazon.com Conditions of Use and the terms contained in the Legal & Compliance section in the Help menu of your Alexa App.", "1.3 Alexa Interactions.", "You control Alexa with your voice.", "Alexa streams audio to the cloud when you interact with Alexa.", "Amazon processes and retains your Alexa Interactions, such as your voice inputs, music playlists, and your Alexa to-do and shopping lists, in the cloud to provide, personalize, and improve our services.", "Learn more about these voice services including how to delete voice recordings associated with your account.", "1.4 Voice Purchasing.", "Alexa allows voice purchasing of physical and digital products and services, including subscriptions, from Amazon and other sellers using your default Amazon payment and shipping settings (an “Amazon-Processed Purchase”).", "You can require a speakable confirmation code, turn off voice purchasing, and see product and order details for Amazon-Processed Purchases in your Alexa App.", "Learn more.", "These settings may not apply to purchases that are not Amazon-Processed Purchases (such as when you provide a credit card directly to the provider of a Third-Party Service), and we are not a party to, and have no responsibility for, those purchases.", "Amazon-Processed Purchases are subject to the Amazon.com Privacy Notice, Amazon.com Conditions of Use, and, in the case of a subscription, the terms for the applicable service.", "If you make an Amazon-Processed Purchase of, or start a free trial for, a subscription, your subscription will automatically continue at the applicable subscription price at the end of the free trial period (if any) and each renewal period, unless you notify us before a charge that you want to cancel or do not want to automatically renew your subscription.", "You authorize us (without notice to you, unless required by applicable law) to collect the subscription price and any taxes using any payment method we have on record for you.", "For any subscription to an Amazon service, please see the terms of use for that service for applicable cancellation, pricing, and refund terms.", "For any Amazon-Processed Purchase that is a subscription to a Third Party Service, (i) we or the third party may cancel the subscription at any time, for example, if the applicable service is no longer available, in which case you will receive a prorated refund, and(ii) terms and prices may change from time to time, effective as of the beginning of the next subscription term.", "Alexa also allows you to make donations to eligible charities by voice.", "When you make a donation, Amazon Pay will process the donation using your default Amazon payment settings and will share your name, address, and email with the charity.", "You can find more information about Amazon-Processed Purchases and donations in our Alexa and Alexa Device FAQs, including applicable terms, return and refund policies, and how to cancel subscriptions.", "1.5 Automatic Voice Recognition & Voice Profiles.", "Alexa can automatically recognize the voices of users in your household over time to improve personalization of certain Alexa features.", "You can also create a voice profile, so Alexa can call you by name and do more to personalize your experience.", "When Alexa recognizes your voice automatically, or when you create a voice profile, Alexa uses recordings of your voice to create an acoustic model of your voice characteristics.", "You can turn off automatic voice recognition or delete any voice profile you’ve created.", "Learn more about voice profiles.", "2.", "Third Party Services; Third Party Products.", "2.1 Third Party Services.", "If you use a Third Party Service, we may exchange related information with that service, such as your ZIP code when you ask for the weather, your custom music stations, information about your Auxiliary Products, or the content of your requests.", "Your use of any Third Party Service is subject to this Agreement and any third party terms applicable to such Third Party Service.", "Certain of these third party terms can be found in the Legal Notices section of your Alexa App, or may be linked from your Alexa App, and may be updated from time to time.", "If you do not accept the third party terms applicable to a Third Party Service, do not use that Third Party Service.", "When using a Third Party Service, you are responsible for any information you provide to the third party.", "Amazon has no responsibility or liability for Third Party Services.", "Publishers of Third Party Services may change or discontinue the functionality or features of their Third Party Service.", "2.2 Third Party Products.", "Alexa Enabled Products and Auxiliary Products include third party products that Amazon does not manufacture or develop.", "Amazon may automatically update the firmware for certain Auxiliary Products on behalf of the applicable manufacturer.", "Amazon has no responsibility or liability for such third party products or manufacturer-provided firmware.", "3.", "General", "3.1 Information.", "The Software will provide Amazon with information about your use of Alexa, your Alexa Interactions, and your Alexa Enabled Products and Auxiliary Products (such as device type, name, features, status, network connectivity, and location).", "This information may be stored on servers outside the country in which you live.", "We will handle any information we receive in accordance with the Amazon.com Privacy Notice.", "3.2 Functionality; Content.", "We do not guarantee that Alexa or its functionality or content (including traffic, health, or stock information) is accurate, reliable, always available, or complete.", "You may encounter content through Alexa that you find offensive, indecent, or objectionable.", "Amazon has no responsibility or liability for such content.", "3.3 Changes to Alexa; Amendments.", "We may change, suspend, or discontinue Alexa, or any part of it, at any time without notice.", "We may amend any of this Agreement's terms at our sole discretion by posting the revised terms on the Amazon.com website.", "Your continued use of Alexa after the effective date of the revised Agreement constitutes your acceptance of the terms.", "3.4 Geographic Restrictions.", "Alexa is operated in the United States.", "We may restrict access to Alexa from other locations.", "3.5 Termination.", "Your rights under this Agreement will automatically terminate without notice if you fail to comply with any of its terms.", "In case of such termination, Amazon may immediately revoke your access to Alexa without refund of any fees.", "Amazon's failure to insist upon or enforce your strict compliance with this Agreement will not constitute a waiver of any of its rights.", "3.6 Disputes/Binding Arbitration.", "Any dispute or claim arising from or relating to this Agreement or Alexa is subject to the binding arbitration, governing law, disclaimer of warranties, limitation of liability, and all other terms in the Amazon.com Conditions of Use.", "By using Alexa, you agree to be bound by those terms.", "3.7 Disclaimer of Warranties and Limitation of Liability.", "Without limiting the Disclaimer of Warranties and Limitation of Liability terms in the Amazon.com Conditions of Use, and unless otherwise required by applicable law, in no event will our or our licensors' or our service providers' aggregate liability with respect to any claim arising from or relating to this Agreement or your use of Alexa exceed fifty dollars ($50).", "3.8 Contact Information.", "For help with Alexa or resolving other issues, please contact Customer Service by e-mail: alexa-support@amazon.com or by phone at 1-877-375-9365 (toll free) when dialing in the US or at (206) 922-0197 (charges may apply) when dialing outside the US.", "Alexa Communication Schedule", "AMCS LLC (“AMCS”), an affiliate of Amazon, may offer you certain Alexa-related communication services, such as the ability to send and receive messages and calls and connect with other Alexa users, and the ability to place outbound calls to phone numbers (collectively, “Alexa Communication”).", "This schedule is part of the Alexa Terms of Use and you agree to these terms when you register for or use Alexa Communication.", "Your use of Alexa Communication is also subject to the Alexa Communication Usage Guidelines, which are part of this schedule.", "AMCS and its affiliates may offer services other than Alexa Communication, which are not covered by this schedule and may be subject to other terms.", "1.1 General.", "Your messages, communications requests (e.g., “Alexa, call Mom”), and related interactions are “Alexa Interactions,” as described in the Alexa Terms of Use.", "Amazon processes and retains your Alexa Interactions and related information in the cloud in order to respond to your requests (e.g., “Send a message to Mom”), to provide additional functionality (e.g., speech to text transcription and vice versa), and to improve our services.", "We also store your messages in the cloud so that they’re available on your Alexa App and select Alexa Enabled Products.", "You or other call participants may be able to ask Alexa to help with certain functions during a call, such as “Alexa, volume up” and “Alexa, hang up.” Certain Alexa Communication services are provided by our third party service providers, and we may provide them with information, such as telephone numbers, to provide those services.", "Alexa Communication is only available on select Alexa Enabled Products, and features may vary.", "Learn more.", "1.2 Registration.", "You provide your phone number when registering for Alexa Communication.", "AMCS will verify this number by sending you an SMS message (carrier charges may apply).", "Other users who know your contact details will be able to contact you using Alexa Communication.", "Your registration name and contact details may be used to identify you to other users, such as when you send a message to a recipient who does not already have your contact details.", "Your phone number also may be displayed as a caller ID on your outbound calls to phone numbers.", "1.3 Contacts.", "Amazon will periodically import and store your contacts to improve your Alexa Communication experience.", "Amazon uses information about your contacts and connections, including who you communicate with the most, to provide and improve our services.", "For example, we use this information to identify most likely call recipients (e.g., when you ask “Alexa, call Bill,” Alexa can better identify which Bill you want to contact).", "1.4 No Access to Emergency Services.", "Alexa Communication are not a replacement for traditional two-way telephone or mobile phone service, and do not function as such.", "You acknowledge that you cannot use Alexa Communication to access emergency services, such as 911.", "Alexa Communication are not designed or intended to be used to send or receive emergency communications to any police, fire department, hospital, or any other service that connects a user to a public safety answering point.", "You should ensure you can contact your relevant emergency services providers through a mobile, landline telephone, or other service.", "1.5 Drop In.", "The optional Drop In feature allows permissioned users to instantly connect to your Alexa Enabled Products for a voice or video chat without you needing to take any action.", "If you grant Drop In permission to yourself, anyone in your household also receives Drop In permission; and if you grant Drop In permission to a contact, anyone in that contact’s household also receives Drop In permission.", "Users with Drop In permission may see an indicator to let them know if your device has been recently active.", "This indicator is based on your Alexa Interactions, and motion sensors on Echo Show.", "Learn more.", "1.6 Fees.", "AMCS does not currently charge fees for Alexa Communication, but reserves the right to place limitations on use of certain services or features, including subscription or other fees.", "You and/or the recipient of your calls or messages may be required to pay carrier fees for data usage.", "AMCS has no responsibility for such fees."], "features": [[2, 0, 0.0, 0.0, 3, 0, 0.0, 0.00187714261450318], [4, 1, 0.007936507936507936, 0.0, 3, 0, 0.024390243902439025, 0.00035268830844643325], [7, 1, 0.015873015873015872, 0.0, 6, 1, 0.04878048780487805, 1.857962739957755e-07], [28, 10, 0.023809523809523808, 0.25, 21, 0, 0.04878048780487805, 1.2553732774367558e-05], [5, 1, 0.031746031746031744, 0.5, 3, 0, 0.04878048780487805, 0.000415009051502176], [4, 1, 0.03968253968253968, 0.75, 3, 0, 0.04878048780487805, 0.0016513957643900135], [3, 0, 0.047619047619047616, 0.0, 4, 0, 0.07317073170731707, 0.00018781661871081527], [17, 5, 0.05555555555555555, 0.0, 9, 0, 0.0975609756097561, 6.38253606555462e-05], [14, 3, 0.06349206349206349, 0.0, 6, 0, 0.12195121951219512, 7.578704260338016e-05], [14, 1, 0.07142857142857142, 0.0, 8, 0, 0.14634146341463414, 9.943995387237884e-05], [28, 4, 0.07936507936507936, 0.0, 14, 0, 0.17073170731707318, 1.935748416927195e-05], [18, 3, 0.0873015873015873, 0.0, 7, 0, 0.1951219512195122, 5.8254954307620706e-06], [6, 0, 0.09523809523809523, 0.0, 2, 0, 0.21951219512195122, 0.0008909578595701382], [9, 0, 0.10317460317460317, 0.0, 4, 0, 0.24390243902439024, 0.0003239948691496824], [1, 0, 0.1111111111111111, 0.0, 0, 0, 0.2682926829268293, 0.0018736579349844453], [1, 0, 0.11904761904761904, 0.5, 1, 0, 0.2682926829268293, 0.026243583508802473], [1, 0, 0.12698412698412698, 0.0, 0, 0, 0.2926829268292683, 0.0032102418366700834], [1, 0, 0.1349206349206349, 0.25, 1, 0, 0.2926829268292683, 0.026243583508802473], [8, 0, 0.14285714285714285, 0.5, 5, 0, 0.2926829268292683, 0.00041542229139837454], [9, 0, 0.15079365079365079, 0.75, 5, 0, 0.2926829268292683, 6.680931898394594e-05], [2, 0, 0.15873015873015872, 0.0, 2, 0, 0.3170731707317073, 0.006961551838063115], [10, 1, 0.16666666666666666, 0.3333333333333333, 8, 0, 0.3170731707317073, 0.0002650535230162615], [18, 1, 0.1746031746031746, 0.6666666666666666, 10, 0, 0.3170731707317073, 5.407985214962869e-05], [3, 0, 0.18253968253968253, 0.0, 2, 0, 0.34146341463414637, 0.013462210908754001], [3, 0, 0.19047619047619047, 0.2, 2, 0, 0.34146341463414637, 0.004078058349249108], [6, 0, 0.1984126984126984, 0.4, 2, 0, 0.34146341463414637, 0.000910606278995346], [18, 6, 0.20634920634920634, 0.6, 4, 0, 0.34146341463414637, 5.09655423093011e-05], [8, 0, 0.21428571428571427, 0.8, 1, 0, 0.34146341463414637, 2.9355634882760177e-05], [3, 0, 0.2222222222222222, 0.0, 2, 0, 0.36585365853658536, 0.0042901534858020285], [18, 2, 0.23015873015873015, 0.16666666666666666, 5, 0, 0.36585365853658536, 1.5949547522607547e-05], [14, 2, 0.23809523809523808, 0.3333333333333333, 5, 0, 0.36585365853658536, 9.943961396769318e-05], [1, 0, 0.24603174603174602, 0.5, 1, 0, 0.36585365853658536, 0.0062506714575448], [15, 3, 0.25396825396825395, 0.6666666666666666, 5, 0, 0.36585365853658536, 3.566521456100666e-05], [13, 4, 0.2619047619047619, 0.8333333333333334, 8, 0, 0.36585365853658536, 0.00011910471003466959], [25, 4, 0.2698412698412698, 0.0, 3, 0, 0.3902439024390244, 2.0822251064664672e-05], [12, 1, 0.2777777777777778, 0.25, 1, 0, 0.3902439024390244, 6.275861530078053e-10], [10, 3, 0.2857142857142857, 0.5, 2, 0, 0.3902439024390244, 0.00023565506268001415], [26, 6, 0.29365079365079366, 0.75, 6, 0, 0.3902439024390244, 4.091726586839937e-06], [6, 0, 0.30158730158730157, 0.0, 1, 0, 0.4146341463414634, 0.0005399639496107806], [14, 3, 0.30952380952380953, 0.5, 4, 0, 0.4146341463414634, 9.571973007594569e-06], [17, 3, 0.31746031746031744, 0.0, 7, 0, 0.43902439024390244, 1.6969219842613084e-05], [7, 0, 0.3253968253968254, 0.0, 5, 0, 0.4634146341463415, 0.00020931242523023345], [11, 0, 0.3333333333333333, 0.16666666666666666, 2, 0, 0.4634146341463415, 0.0001582656191623637], [7, 1, 0.3412698412698413, 0.3333333333333333, 2, 0, 0.4634146341463415, 6.920545497142509e-05], [15, 2, 0.3492063492063492, 0.5, 3, 0, 0.4634146341463415, 2.147383384514237e-05], [8, 0, 0.35714285714285715, 0.6666666666666666, 1, 0, 0.4634146341463415, 3.374685629663725e-05], [3, 0, 0.36507936507936506, 0.8333333333333334, 1, 0, 0.4634146341463415, 0.004404074431869306], [1, 0, 0.373015873015873, 0.0, 0, 0, 0.4878048780487805, 0.0018736579349844453], [4, 0, 0.38095238095238093, 0.5, 6, 0, 0.4878048780487805, 0.002385769418846481], [3, 0, 0.3888888888888889, 0.0, 3, 0, 0.5121951219512195, 0.008332517509636355], [17, 5, 0.3968253968253968, 0.125, 7, 1, 0.5121951219512195, 1.5044026326030772e-05], [9, 0, 0.40476190476190477, 0.25, 8, 0, 0.5121951219512195, 0.0002800120140402097], [14, 2, 0.4126984126984127, 0.375, 7, 0, 0.5121951219512195, 4.8304657393745835e-05], [8, 1, 0.42063492063492064, 0.5, 7, 0, 0.5121951219512195, 0.00036653012571221354], [6, 1, 0.42857142857142855, 0.625, 4, 0, 0.5121951219512195, 0.0005670776763465491], [5, 0, 0.4365079365079365, 0.75, 4, 0, 0.5121951219512195, 0.001095922730050542], [9, 0, 0.4444444444444444, 0.875, 7, 0, 0.5121951219512195, 0.0002800088023323696], [3, 0, 0.4523809523809524, 0.0, 3, 0, 0.5365853658536586, 0.007697815211038509], [11, 0, 0.4603174603174603, 0.25, 6, 0, 0.5365853658536586, 1.58006869825282e-05], [9, 0, 0.46825396825396826, 0.5, 3, 0, 0.5365853658536586, 5.843398219187737e-05], [7, 0, 0.47619047619047616, 0.75, 1, 0, 0.5365853658536586, 9.158179892025501e-05], [1, 0, 0.48412698412698413, 0.0, 0, 0, 0.5609756097560976, 0.0018736579349844453], [1, 0, 0.49206349206349204, 0.5, 1, 0, 0.5609756097560976, 0.0032102418366700834], [2, 0, 0.5, 0.0, 1, 0, 0.5853658536585366, 0.012816312843980698], [19, 7, 0.5079365079365079, 0.25, 11, 0, 0.5853658536585366, 5.224306956578403e-06], [5, 0, 0.5158730158730159, 0.5, 1, 0, 0.5853658536585366, 7.561038587465953e-05], [7, 0, 0.5238095238095238, 0.75, 4, 0, 0.5853658536585366, 0.0002035352376589671], [3, 0, 0.5317460317460317, 0.0, 2, 0, 0.6097560975609756, 0.0031186957705998226], [12, 5, 0.5396825396825397, 0.25, 2, 0, 0.6097560975609756, 1.3013489174652574e-05], [7, 2, 0.5476190476190477, 0.5, 2, 0, 0.6097560975609756, 4.119565170727537e-05], [4, 0, 0.5555555555555556, 0.75, 1, 0, 0.6097560975609756, 0.0006004653615721311], [3, 0, 0.5634920634920635, 0.0, 3, 0, 0.6341463414634146, 0.016833088692340556], [7, 4, 0.5714285714285714, 0.25, 2, 0, 0.6341463414634146, 0.00015380529471227124], [10, 0, 0.5793650793650794, 0.5, 3, 0, 0.6341463414634146, 6.475014185826105e-05], [9, 0, 0.5873015873015873, 0.75, 3, 0, 0.6341463414634146, 0.00023503698546817637], [3, 0, 0.5952380952380952, 0.0, 2, 0, 0.6585365853658537, 0.0008327368599930869], [4, 0, 0.6031746031746031, 0.3333333333333333, 3, 0, 0.6585365853658537, 0.0008960925176555379], [4, 0, 0.6111111111111112, 0.6666666666666666, 2, 0, 0.6585365853658537, 0.0005706741391041289], [2, 0, 0.6190476190476191, 0.0, 1, 0, 0.6829268292682927, 0.002609084139989615], [8, 0, 0.626984126984127, 0.25, 2, 0, 0.6829268292682927, 0.00029586005148304586], [9, 1, 0.6349206349206349, 0.5, 3, 0, 0.6829268292682927, 9.297938406351338e-05], [10, 0, 0.6428571428571429, 0.75, 2, 0, 0.6829268292682927, 3.2103339114483226e-05], [3, 0, 0.6507936507936508, 0.0, 2, 0, 0.7073170731707317, 0.0011595929511064955], [18, 4, 0.6587301587301587, 0.3333333333333333, 6, 0, 0.7073170731707317, 2.162375956244489e-10], [4, 1, 0.6666666666666666, 0.6666666666666666, 2, 0, 0.7073170731707317, 0.0013267316385489928], [5, 0, 0.6746031746031746, 0.0, 4, 0, 0.7317073170731707, 0.0003711033131181433], [27, 2, 0.6825396825396826, 0.5, 10, 0, 0.7317073170731707, 2.7809905828705886e-06], [3, 0, 0.6904761904761905, 0.0, 2, 0, 0.7560975609756098, 0.0059320367387217035], [18, 1, 0.6984126984126984, 0.5, 6, 2, 0.7560975609756098, 3.4325553860292836e-13], [3, 0, 0.7063492063492064, 0.0, 3, 0, 0.7804878048780488, 0.012654906562155514], [26, 5, 0.7142857142857143, 0.0, 8, 3, 0.8048780487804879, 2.6030597534356775e-05], [9, 0, 0.7222222222222222, 0.25, 6, 0, 0.8048780487804879, 0.00031226918724724305], [9, 1, 0.7301587301587301, 0.5, 7, 0, 0.8048780487804879, 7.743500562330954e-05], [10, 1, 0.7380952380952381, 0.75, 3, 1, 0.8048780487804879, 0.0001898447144428463], [2, 0, 0.746031746031746, 0.0, 1, 0, 0.8292682926829268, 0.0032102418366700834], [12, 5, 0.753968253968254, 0.14285714285714285, 8, 0, 0.8292682926829268, 8.695102830117273e-09], [24, 4, 0.7619047619047619, 0.2857142857142857, 5, 0, 0.8292682926829268, 2.8579010056245653e-05], [9, 0, 0.7698412698412699, 0.42857142857142855, 6, 0, 0.8292682926829268, 0.0002562627674381133], [22, 6, 0.7777777777777778, 0.5714285714285714, 7, 0, 0.8292682926829268, 3.40292204359591e-05], [8, 1, 0.7857142857142857, 0.7142857142857143, 5, 0, 0.8292682926829268, 3.314205233906248e-05], [1, 0, 0.7936507936507936, 0.8571428571428571, 1, 0, 0.8292682926829268, 0.0062506714575448], [2, 0, 0.8015873015873016, 0.0, 1, 0, 0.8536585365853658, 0.0032102418366700834], [6, 0, 0.8095238095238095, 0.16666666666666666, 3, 0, 0.8536585365853658, 0.0009298193422588814], [9, 0, 0.8174603174603174, 0.3333333333333333, 2, 2, 0.8536585365853658, 6.807556874816875e-05], [6, 0, 0.8253968253968254, 0.5, 3, 0, 0.8536585365853658, 0.000905683859281016], [10, 1, 0.8333333333333334, 0.6666666666666666, 1, 0, 0.8536585365853658, 7.862284327846714e-05], [8, 0, 0.8412698412698413, 0.8333333333333334, 2, 1, 0.8536585365853658, 9.890257310572081e-05], [2, 0, 0.8492063492063492, 0.0, 1, 0, 0.8780487804878049, 0.00441255723003102], [9, 0, 0.8571428571428571, 0.25, 3, 0, 0.8780487804878049, 0.0001250928745725049], [9, 2, 0.8650793650793651, 0.5, 1, 0, 0.8780487804878049, 0.00020884876314112988], [11, 4, 0.873015873015873, 0.75, 5, 0, 0.8780487804878049, 8.330533495152819e-05], [4, 0, 0.8809523809523809, 0.0, 4, 0, 0.9024390243902439, 0.0021723158037259944], [10, 1, 0.8888888888888888, 0.2, 2, 0, 0.9024390243902439, 1.880316144975806e-09], [7, 1, 0.8968253968253969, 0.4, 3, 0, 0.9024390243902439, 4.2689656043038766e-05], [19, 3, 0.9047619047619048, 0.6, 2, 0, 0.9024390243902439, 5.821003465498689e-06], [10, 2, 0.9126984126984127, 0.8, 1, 0, 0.9024390243902439, 0.00017644330971059843], [2, 0, 0.9206349206349206, 0.0, 2, 0, 0.926829268292683, 0.0016547089612616323], [15, 0, 0.9285714285714286, 0.16666666666666666, 6, 0, 0.926829268292683, 8.327802357287217e-06], [16, 2, 0.9365079365079365, 0.3333333333333333, 9, 0, 0.926829268292683, 3.16776192116531e-05], [7, 0, 0.9444444444444444, 0.5, 3, 0, 0.926829268292683, 5.22706352069696e-05], [8, 1, 0.9523809523809523, 0.6666666666666666, 5, 0, 0.926829268292683, 4.265257142699752e-05], [1, 0, 0.9603174603174603, 0.8333333333333334, 1, 0, 0.926829268292683, 0.0062506714575448], [2, 0, 0.9682539682539683, 0.0, 1, 0, 0.9512195121951219, 0.005466636396363459], [13, 2, 0.9761904761904762, 0.25, 3, 1, 0.9512195121951219, 4.446067165980028e-05], [10, 0, 0.9841269841269841, 0.5, 1, 0, 0.9512195121951219, 3.8536349332234884e-05], [3, 0, 0.9920634920634921, 0.75, 1, 1, 0.9512195121951219, 0.0012805194999831362]], "labels": [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, 1, 1, -1, -1, 1, 1, 1, 1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, 1, -1, -1, -1, -1, -1, -1, 1, 1, -1, -1, 1, 1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, 1, 1, -1, -1, 1, 1, 1, 1, -1, -1, 1, 1, 1, -1, -1, -1, -1, -1]}