{"sentences": ["Atlassian Cloud Terms of Service", "Effective starting: November 1, 2018", "Thanks for using Atlassian’s Cloud Products!", "These Atlassian Cloud Terms of Service (these “Terms”) describe your rights and responsibilities as a customer of our Cloud Products.", "As applicable to the specific Cloud Product, if you are being invited or added to a Cloud Product set up by an Atlassian customer, the User Notice governs your access and use of the Cloud Product (and not these Terms).", "These Terms are between you and the Atlassian entity that owns or operates the Cloud Product that you are using or accessing listed here (“Atlassian”, “we” or “us”).", "“You” means the entity you represent in accepting these Terms or, if that does not apply, you individually.", "If you are accepting on behalf of your employer or another entity, you represent and warrant that: (i) you have full legal authority to bind your employer or such entity to these Terms; (ii) you have read and understand these Terms; and (iii) you agree to these Terms on behalf of the party that you represent.", "If you don’t have the legal authority to bind your employer or the applicable entity please do not click “I agree” (or similar button or checkbox) that is presented to you.", "PLEASE NOTE THAT IF YOU SIGN UP FOR A CLOUD PRODUCT USING AN EMAIL ADDRESS FROM YOUR EMPLOYER OR ANOTHER ENTITY, THEN (A) YOU WILL BE DEEMED TO REPRESENT SUCH PARTY, (B) YOUR CLICK TO ACCEPT WILL BIND YOUR EMPLOYER OR THAT ENTITY TO THESE TERMS, AND (C) THE WORD “YOU” IN THESE TERMS WILL REFER TO YOUR EMPLOYER OR THAT ENTITY.", "These Terms are effective as of the date you first click “I agree” (or similar button or checkbox) or use or access a Cloud Product, whichever is earlier (the “Effective Date”).", "These Terms do not have to be signed in order to be binding.", "You indicate your assent to these Terms by clicking “I agree” (or similar button or checkbox) at the time you register for a Cloud Product, create a Cloud Product account, or place an Order.", "For No-Charge Products, you also indicate your assent to these Terms by accessing or using the applicable No-Charge Product.", "1.", "What these Terms cover.", "1.1.", "Cloud Products.", "These Terms govern our Cloud Products, related Support, and Additional Services.", "These Terms include Our Policies (including our Privacy Policy), the Product-Specific Terms, and your Orders.", "1.2.", "Product-Specific Terms.", "Some Cloud Products may be subject to additional terms specific to that product as set forth in the Product-Specific Terms.", "By accessing or using a product covered by the Product-Specific Terms, you also agree to the Product-Specific Terms.", "1.3.", "Software Products Not Covered.", "These Terms do not apply to our downloadable software products (currently designated as “Server” and “Data Center” deployments), use of which requires a separate license agreement with us.", "For clarity, however, any client software (e.g., a desktop or mobile application) we provide as part of the Cloud Products themselves remains subject to these Terms.", "2.", "How Cloud Products are administered.", "2.1.", "Administrators.", "Through the Cloud Products, you may be able to specify certain End Users as Administrators, who will have important rights and controls over your use of Cloud Products and End User Accounts.", "This may include making Orders for Cloud Products or enabling Apps (which may incur fees); creating, de-provisioning, monitoring or modifying End User Accounts, and setting End User usage permissions; and managing access to Your Data by End Users or others.", "Administrators may also take over management of accounts previously registered using an email address belonging to your domain (which become “managed accounts”, as described in our Documentation).", "Without limiting Section 2.4 (Responsibility for End Users), which fully applies to Administrators, you are responsible for whom you allow to become Administrators and any actions they take, including as described above.", "You agree that our responsibilities do not extend to the internal management or administration of the Cloud Products for you.", "2.2.", "Reseller as Administrator.", "If you order Cloud Products through a Reseller, then you are responsible for determining whether the Reseller may serve as an Administrator and for any related rights or obligations in your applicable agreement with the Reseller.", "As between you and Atlassian, you are solely responsible for any access by Reseller to your accounts or your other End User Accounts.", "2.3.", "End User Consent.", "You will provide all required disclosures to and will obtain and maintain all required consents from End Users to allow: (i) Administrators to have the access described in these Terms and the Privacy Policy; and (ii) Atlassian’s provision of the Cloud Products to Administrators and End Users.", "You will provide evidence of such consents upon our reasonable request.", "2.4.", "Responsibility for End Users.", "Our Cloud Products have various user onboarding flows.", "Some Cloud Products require users to be designated by Administrators; some allow users to sign up for individual accounts which can become associated with teams or organizations at a later time; and some may allow users to invite other users.", "You are responsible for understanding the settings and controls for each Cloud Product you use and for controlling whom you allow to become an End User.", "If payment is required for End Users to use or access a Cloud Product, then we are only required to provide the Cloud Products to those End Users for whom you have paid the applicable fees, and only such End Users are permitted to access and use the Cloud Products.", "Some Cloud Products may allow you to designate different types of End Users (for example, Jira Service Desk distinguishes between “agents” and “customers”), in which case pricing and functionality may vary according to the type of End User.", "You are responsible for compliance with these Terms by all End Users, including for any payment obligations.", "Please note that you are responsible for the activities of all your End Users, including Orders they may place and how End Users use Your Data, even if those End Users are not from your organization or domain.", "We may display our User Notice to End Users at sign up, account creation, Cloud Product registration, or in-product.", "If you use single sign-on (SSO) for identity management of your Cloud Product(s) such that End Users will bypass these screens and our User Notice, you are responsible for displaying our User Notice to End Users and for any damages resulting from your failure to do so.", "2.5.", "Credentials.", "You must require that all End Users keep their user IDs and passwords for the Cloud Products strictly confidential and do not share such information with any unauthorized person.", "User IDs are granted to individual, named persons and may not be shared.", "You are responsible for any and all actions taken using End User Accounts and passwords, and you agree to immediately notify us of any unauthorized use of which you become aware.", "2.6.", "Age Requirement for End Users.", "The Cloud Products are not intended for, and should not be used by, anyone under the age of 16.", "You are responsible for ensuring that all End Users are at least 16 years old.", "2.7.", "Domain Name Ownership.", "Where you are required to specify a domain for the operation of a Cloud Product or certain Cloud Product features, we may verify that you own or control that domain.", "If you do not own or control the domain you specify, then we will have no obligation to provide you with the Cloud Product or Cloud Product features.", "3.", "What's included in your Cloud Product subscriptions; what are the restrictions.", "3.1.", "Access to Cloud Products.", "Subject to these Terms and during the applicable Subscription Term, you may access and use the Cloud Products for your own business purposes or personal use, as applicable, all in accordance with these Terms, the applicable Order and the Documentation.", "This includes the right, as part of your authorized use of the Cloud Products, to download and use the client software associated with the Cloud Products.", "The rights granted to you in this Section 3.1 are non-exclusive, non-sublicensable and non-transferable.", "3.2.", "Support.", "During the Subscription Term, we will provide Support for the Cloud Products in accordance with the Support Policy, Enterprise Support and Services Policy (to the extent applicable), and the applicable Order.", "3.3.", "Restrictions.", "Except as otherwise expressly permitted in these Terms, you will not: (a) reproduce, modify, adapt or create derivative works of the Cloud Products; (b) rent, lease, distribute, sell, sublicense, transfer or provide access to the Cloud Products to a third party; (c) use the Cloud Products for the benefit of any third party; (d) incorporate any Cloud Products into a product or service you provide to a third party; (e) interfere with or otherwise circumvent mechanisms in the Cloud Products intended to limit your use; (f) reverse engineer, disassemble, decompile, translate or otherwise seek to obtain or derive the source code, underlying ideas, algorithms, file formats or non-public APIs to any Cloud Products, except to the extent expressly permitted by applicable law (and then only upon advance notice to us); (g) remove or obscure any proprietary or other notices contained in any Cloud Product; (h) use the Cloud Products for competitive analysis or to build competitive products; (i) publicly disseminate information regarding the performance of the Cloud Products; or (j) encourage or assist any third party to do any of the foregoing.", "4.", "Our security and data privacy policies.", "4.1.", "Security.", "We implement security procedures designed to help protect Your Data from security attacks.", "4.2.", "Privacy.", "We collect certain data and information about you and your End Users in connection with your and your End Users’ use of the Cloud Products and otherwise in connection with these Terms.", "We collect and use all such data and information in accordance with our Privacy Policy, which you acknowledge.", "4.3.", "Improving Cloud Products.", "We are always striving to improve the Cloud Products.", "In order to do so, we use analytics techniques to better understand how our Cloud Products are being used.", "For more information on these techniques and the type of data collected, please read our Privacy Policy.", "4.4.", "Subpoenas.", "Nothing in these Terms prevents us from disclosing Your Data to the extent required by law, subpoenas or court orders, but we will use commercially reasonable efforts to notify you where permitted to do so.", "Atlassian strives to balance your privacy rights with other legal requirements; to read more about Atlassian’s policies and guidelines for law enforcement officials requesting access to customer data, please see our Guidelines for Law Enforcement Requests.", "4.5.", "GDPR Data Processing Addendum.", "If you are in the EEAU, Switzerland, or are otherwise subject to the territorial scope of Regulation (EU) 2016/679 (General Data Protection Regulation) or any successor legislation, you can request and complete the Atlassian Data Processing Addendum here.", "5.", "Terms that apply to Your Data.", "5.1.", "Using Your Data to provide Cloud Products to You.", "You retain all right, title and interest in and to Your Data in the form submitted to the Cloud Products.", "Subject to these Terms, and solely to the extent necessary to provide the Cloud Products to you, you grant us a worldwide, limited term license to access, use, process, copy, distribute, perform, export, and display Your Data.", "Solely to the extent that reformatting Your Data for display in a Cloud Product constitutes a modification or derivative work, the foregoing license also includes the right to make modifications and derivative works.", "We may also access your accounts, End User Accounts, and your Cloud Products with End User permission in order to respond to your support requests.", "5.2.", "Your Data Compliance Obligations.", "You and your use of Cloud Products (including use by your End Users) must comply at all times with these Terms, the Acceptable Use Policy and all Laws.", "You represent and warrant that: (i) you have obtained all necessary rights, releases and permissions to submit all Your Data to the Cloud Products and to grant the rights granted to us in these Terms and (ii) Your Data and its submission and use as you authorize in these Terms will not violate (1) any Laws, (2) any third-party intellectual property, privacy, publicity or other rights, or (3) any of your or third-party policies or terms governing Your Data.", "Other than our express obligations under Section 4 (Our security and data privacy policies), we assume no responsibility or liability for Your Data, and you are solely responsible for Your Data and the consequences of submitting and using it with the Cloud Products.", "5.3.", "No Sensitive Data.", "You will not submit to the Cloud Products (or use the Cloud Products to collect) any Sensitive Data.", "You also acknowledge that we are not acting as your Business Associate or subcontractor (as such terms are defined and used in HIPAA).", "The Cloud Products are neither HIPAA nor PCI DSS compliant.", "Notwithstanding any other provision to the contrary, we have no liability under these Terms for Sensitive Data.", "5.4.", "Your Indemnity.", "You will defend, indemnify and hold harmless us (and our Affiliates, officers, directors, agents and employees) from and against any and all claims, costs, damages, losses, liabilities and expenses (including reasonable attorneys’ fees and costs) resulting from any claim arising from or related to (i) your breach of Section 2.3 (End User Consent) or any claims or disputes brought by your End Users arising out of their use of Cloud Products, (ii) your breach (or alleged breach) of Sections 5.2 (Your Data Compliance Obligations) or 5.3 (No Sensitive Data); or (iii) Your Materials.", "This indemnification obligation is subject to you receiving (a) prompt written notice of such claim (but in any event notice in sufficient time for you to respond without prejudice); (b) the exclusive right to control and direct the investigation, defense or settlement of such claim and (c) all reasonable necessary cooperation by us at your expense.", "5.5.", "Removals and Suspension.", "We have no obligation to monitor any content uploaded to the Cloud Products.", "Nonetheless, if we deem such action necessary based on your violation of these Terms, including Our Policies, or in response to takedown requests that we receive following our guidelines for Reporting Copyright and Trademark Violations, we may (1) remove Your Data from the Cloud Products or (2) suspend your access to the Cloud Products.", "We will use reasonable efforts to provide you with advance notice of removals and suspensions when practicable, but if we determine that your actions endanger the operation of the Cloud Product or other users, we may suspend your access or remove Your Data immediately without notice.", "We have no liability to you for removing or deleting Your Data from or suspending your access to any Cloud Products as described in this Section 5.5.", "6.", "Using third-party products with the Cloud Products.", "6.1.", "Third-Party Products.", "You (including your End Users) may choose to use or procure other third party products or services in connection with the Cloud Products, including Third Party Apps (see Section 6.2 (Marketplace Apps)) or implementation, customization, training or other services.", "Your receipt or use of any third party products or services (and the third parties’ use of any of Your Data) is subject to a separate agreement between you and the third party provider.", "If you enable or use third party products or services with the Cloud Products (including Third Party Apps as referenced in Section 6.2 (Marketplace Apps)), we will allow the third party providers to access or use Your Data as required for the interoperation of their products and services with the Cloud Products.", "This may include transmitting, transferring, modifying or deleting Your Data, or storing Your Data on systems belonging to the third party providers or other third parties.", "Any third party provider’s use of Your Data is subject to the applicable agreement between you and such third party provider.", "We are not responsible for any access to or use of Your Data by third party providers or their products or services, or for the security or privacy practices of any third party provider or its products or services.", "You are solely responsible for your decision to permit any third party provider or third party product or service to use Your Data.", "It is your responsibility to carefully review the agreement between you and the third party provider, as provided by the applicable third party provider.", "WE DISCLAIM ALL LIABILITY AND RESPONSIBILITY FOR ANY THIRD PARTY PRODUCTS OR SERVICES (WHETHER SUPPORT, AVAILABILITY, SECURITY OR OTHERWISE) OR FOR THE ACTS OR OMISSIONS OF ANY THIRD PARTY PROVIDERS OR VENDORS.", "6.2.", "Marketplace Apps.", "As further described in the Atlassian Marketplace Terms of Use, the Atlassian Marketplace lists a variety of Apps that may be used with Cloud Products, including both Atlassian Apps and Third Party Apps.", "Atlassian Apps for Cloud Products are considered “Cloud Products” under these Terms (unless we specify otherwise through the Atlassian Marketplace).", "Third Party Apps are not Cloud Products and remain subject to their own applicable Vendor Terms.", "We may enable interoperation of the Cloud Products with Third Party Apps as set forth in Section 6.1 (Third-Party Products).", "The terms “Apps”, “Atlassian Apps”, “Third Party Apps”, “Vendor” and “Vendor Terms” are defined in the Atlassian Marketplace Terms of Use, which is a separate agreement governing use of the Atlassian Marketplace.", "7.", "Using Atlassian developer assets.", "Access to any of our APIs, SDKs or other Atlassian developer assets is subject to the Atlassian Developer Terms, which is a separate agreement.", "8.", "Additional Services.", "8.1.", "Additional Services.", "Subject to these Terms, you may purchase Additional Services that we will provide to you pursuant to the applicable Order.", "Additional Services may be subject to additional policies and terms as specified by us, including the Enterprise Support and Services Policy.", "8.2.", "Our Deliverables.", "We will retain all right, title and interest in and to Our Deliverables.", "You may use any of Our Deliverables provided to you only in connection with the Cloud Products, subject to the same usage rights and restrictions as for the Cloud Products.", "For clarity, Our Deliverables are not considered Cloud Products, and any Cloud Products are not considered to be Our Deliverables.", "8.3.", "Your Materials.", "You agree to provide us with reasonable access to Your Materials as reasonably necessary for our provision of Additional Services.", "If you do not provide us with timely access to Your Materials, our performance of Additional Services will be excused until you do so.", "You retain your rights in Your Materials, subject to our ownership of any Cloud Products, any of Our Deliverables or any of Our Technology underlying Your Materials.", "We will use Your Materials solely for purposes of performing the Additional Services.", "You represent and warrant that you have all necessary rights in Your Materials to provide them to us for such purposes.", "8.4.", "Training Not Covered.", "Your purchase, and our provision, of Training is subject to our Training Terms and Policies, which is a separate agreement.", "9.", "Billing, renewals, and payment.", "9.1.", "Monthly and Annual Plans.", "Except for No-Charge Products, all Cloud Products are offered either on a monthly subscription basis or an annual subscription basis.", "9.2.", "Renewals.", "Except as otherwise specified in your Order, unless either party cancels your subscription prior to expiration of the current Subscription Term, your subscription will automatically renew for another Subscription Term of a period equal to your initial Subscription Term.", "You will provide any notice of non-renewal through the means we designate, which may include account settings in the Cloud Products or contacting our support team.", "Cancelling your subscription means that you will not be charged for the next billing cycle, but you will not receive any refunds or credits for amounts that have already been charged.", "All renewals are subject to the applicable Cloud Product continuing to be offered and will be charged at the then-current rates.", "9.3.", "Adding Users.", "You may add users, increase storage limits, or otherwise increase your use of Cloud Products by placing a new Order or modifying an existing Order.", "Unless otherwise specified in the applicable Order, we will charge you for any increased use at our then-current rates, prorated for the remainder of the then-current Subscription Term.", "9.4.", "Payment.", "You will pay all fees in accordance with each Order, by the due dates and in the currency specified in the Order.", "If a PO number is required in order for an invoice to be paid, then you must provide such PO number to Atlassian by emailing the PO number to accountsreceivable@atlassian.com.", "For Additional Services provided at any non-Atlassian location, unless otherwise specified in your Order, you will reimburse us for our pre-approved travel, lodging and meal expenses, which we may charge as incurred.", "Other than as expressly set forth in Section 10 (Our return policy), 18.3 (Warranty Remedy), Section 20 (IP Indemnification) or Section 24 (Changes to these Terms), all amounts are non-refundable, non-cancelable and non-creditable.", "You agree that we may bill your credit card or other payment method for renewals, additional users, overages to set limits or scopes of use, expenses, and unpaid fees, as applicable.", "9.5.", "Delivery.", "We will deliver the login instructions for Cloud Products to your account or through other reasonable means no later than when we have received payment of the applicable fees.", "You are responsible for accessing your account to determine that we have received payment and that your Order has been processed.", "All deliveries under these Terms will be electronic.", "10.", "Our return policy.", "As part of our commitment to customer satisfaction and without limiting the Performance Warranty in Section 18 (Warranties and Disclaimer), you may terminate your initial Order of a Cloud Product under these Terms, for no reason or any reason, by providing notice of termination to us no later than thirty (30) days after the Order date for such Cloud Product.", "In the event you terminate your initial Order under this Section 10, at your request (which may be made through your account with us), we will refund you the amount paid under such Order.", "This termination and refund right applies only to your initial Order of the Cloud Product and only if you exercise your termination right within the period specified above, and does not apply to Additional Services.", "You understand that we may change this practice in the future in accordance with Section 24 (Changes to these Terms).", "11.", "Taxes not included.", "11.1.", "Taxes.", "Your fees under these Terms exclude any taxes or duties payable in respect of the Cloud Products in the jurisdiction where the payment is either made or received.", "To the extent that any such taxes or duties are payable by us, you must pay to us the amount of such taxes or duties in addition to any fees owed under these Terms.", "Notwithstanding the foregoing, if you have obtained an exemption from relevant taxes or duties as of the time such taxes or duties are levied or assessed, you may provide us with such exemption information, and we will use reasonable efforts to provide you with invoicing documents designed to enable you to obtain a refund or credit from the relevant revenue authority, if such a refund or credit is available.", "11.2.", "Withholding Taxes.", "You will pay all fees net of any applicable withholding taxes.", "You and we will work together to avoid any withholding tax if exemptions, or a reduced treaty withholding rate, are available.", "If we qualify for a tax exemption, or a reduced treaty withholding rate, we will provide you with reasonable documentary proof.", "You will provide us reasonable evidence that you have paid the relevant authority for the sum withheld or deducted.", "12.", "If you purchased through a Reseller.", "If you make any purchases through an authorized partner or reseller of Atlassian (“Reseller”):", "(a) Instead of paying us, you will pay the applicable amounts to the Reseller, as agreed between you and the Reseller.", "We may suspend or terminate your rights to use Cloud Products if we do not receive the corresponding payment from the Reseller.", "(b) Your order details (e.g., the Cloud Products you are entitled to use, the number of End Users, the Subscription Term, etc.)", "will be as stated in the Order placed with us by the Reseller on your behalf, and Reseller is responsible for the accuracy of any such Order as communicated to us.", "(c) If you are entitled to a refund under these Terms, then unless we otherwise specify, we will refund any applicable fees to the Reseller and the Reseller will be solely responsible for refunding the appropriate amounts to you.", "(d) Resellers are not authorized to modify these Terms or make any promises or commitments on our behalf, and we are not bound by any obligations to you other than as set forth in these Terms.", "13.", "No contingencies on other products of future functionality.", "You acknowledge that the Cloud Products and Additional Services referenced in an Order are being purchased separately from any of our other products or services.", "Payment obligations for any products or services are not contingent on the purchase or use of any of our other products (and for clarity, any purchases of Cloud Products and Additional Services are separate and not contingent on each other, even if listed on the same Order).", "You agree that your purchases are not contingent on the delivery of any future functionality or features (including future availability of any Cloud Products beyond the current Subscription Term), or dependent on any oral or written public comments we make regarding future functionality or features.", "14.", "Evaluations, trials, and betas.", "We may offer certain Cloud Products (including some Atlassian Apps) to you at no charge, including free accounts, trial use and Beta Versions as defined below (collectively, “No-Charge Products”).", "Your use of No-Charge Products is subject to any additional terms that we specify and is only permitted during the Subscription Term we designate (or, if not designated, until terminated in accordance with these Terms).", "Except as otherwise set forth in this Section 14, the terms and conditions of these Terms governing Cloud Products, including Section 3.3 (Restrictions), fully apply to No-Charge Products.", "We may modify or terminate your right to use No-Charge Products at any time and for any reason in our sole discretion, without liability to you.", "You understand that any pre-release and beta Cloud Products, and any pre-release and beta features within generally available Cloud Products, that we make available (collectively, “Beta Versions”) are still under development, may be inoperable or incomplete and are likely to contain more errors and bugs than generally available Cloud Products.", "We make no promises that any Beta Versions will ever be made generally available.", "In some circumstances, we may charge a fee in order to allow you to access Beta Versions, but the Beta Versions will still remain subject to this Section 14.", "All information regarding the characteristics, features or performance of any No-Charge Products (including Beta Versions) constitutes our Confidential Information.", "To the maximum extent permitted by applicable law, we disclaim all obligations or liabilities with respect to No-Charge Products, including any Support, warranty and indemnity obligations.", "NOTWITHSTANDING ANYTHING ELSE IN THESE TERMS, OUR MAXIMUM AGGREGATE LIABILITY TO YOU IN RESPECT OF NO-CHARGE PRODUCTS WILL BE US$100.", "15.", "IP Rights in the Cloud Products and Feedback.", "Cloud Products are made available on a limited access basis, and no ownership right is conveyed to you, irrespective of the use of terms such as “purchase” or “sale”.", "We and our licensors have and retain all right, title and interest, including all intellectual property rights, in and to Our Technology (including the Cloud Products).", "From time to time, you may choose to submit Feedback to us.", "We may in connection with any of our products or services freely use, copy, disclose, license, distribute and exploit any Feedback in any manner without any obligation, royalty or restriction based on intellectual property rights or otherwise.", "No Feedback will be considered your Confidential Information, and nothing in these Terms limits our right to independently use, develop, evaluate, or market products or services, whether incorporating Feedback or otherwise.", "16.", "Confidentiality.", "Except as otherwise set forth in these Terms, each party agrees that all code, inventions, know-how and business, technical and financial information disclosed to such party (“Receiving Party”) by the disclosing party (\"Disclosing Party\") constitute the confidential property of the Disclosing Party (“Confidential Information”), provided that it is identified as confidential at the time of disclosure or should be reasonably known by the Receiving Party to be confidential or proprietary due to the nature of the information disclosed and the circumstances surrounding the disclosure.", "Any of Our Technology and any performance information relating to the Cloud Products will be deemed our Confidential Information without any marking or further designation.", "Except as expressly authorized herein, the Receiving Party will (1) hold in confidence and not disclose any Confidential Information to third parties and (2) not use Confidential Information for any purpose other than fulfilling its obligations and exercising its rights under these Terms.", "The Receiving Party may disclose Confidential Information to its employees, agents, contractors and other representatives having a legitimate need to know, provided that they are bound to confidentiality obligations no less protective of the Disclosing Party than this Section 16 and that the Receiving Party remains responsible for compliance by them with the terms of this Section 16.", "The Receiving Party's confidentiality obligations will not apply to information which the Receiving Party can document: (i) was rightfully in its possession or known to it prior to receipt of the Confidential Information; (ii) is or has become public knowledge through no fault of the Receiving Party; (iii) is rightfully obtained by the Receiving Party from a third party without breach of any confidentiality obligation; or (iv) is independently developed by employees of the Receiving Party who had no access to such information.", "The Receiving Party may also disclose Confidential Information if so required pursuant to a regulation, law or court order (but only to the minimum extent required to comply with such regulation or order and with advance notice to the Disclosing Party).", "The Receiving Party acknowledges that disclosure of Confidential Information would cause substantial harm for which damages alone would not be a sufficient remedy, and therefore that upon any such disclosure by the Receiving Party the Disclosing Party will be entitled to appropriate equitable relief in addition to whatever other remedies it might have at law.", "17.", "Term and Termination.", "17.1.", "Term.", "These Terms are effective as of the Effective Date and expire on the date of expiration or termination of all Subscription Terms.", "17.2.", "Termination for Cause.", "Either party may terminate these Terms (including all related Orders) if the other party (a) fails to cure any material breach of these Terms within thirty (30) days after notice; (b) ceases operation without a successor; or (c) seeks protection under any bankruptcy, receivership, trust deed, creditors’ arrangement, composition or comparable proceeding, or if any such proceeding is instituted against that party (and not dismissed within sixty (60) days thereafter).", "17.3.", "Termination for Convenience.", "You may choose to stop using the Cloud Products and terminate these Terms (including all Orders) at any time for any reason upon written notice to us, but, unless you are exercising your right to terminate early pursuant to Section 10 (Our return policy), upon any such termination (i) you will not be entitled to a refund of any pre-paid fees and (ii) if you have not already paid all applicable fees for the then-current Subscription Term or related services period (as applicable), any such fees that are outstanding will become immediately due and payable.", "17.4.", "Effects of Termination.", "Upon any expiration or termination of these Terms, you must cease using all Cloud Products and delete (or at our request, return) all Confidential Information or other materials of ours in your possession, including on any third-party systems operated on your behalf.", "You will certify such deletion upon our request.", "You will not have access to Your Data (and we may delete all of Your Data unless legally prohibited) after expiration or termination of these Terms (or its applicable Subscription Term), so you should make sure to export Your Data using the functionality of the Cloud Products during the applicable Subscription Term.", "If you terminate these Terms in accordance with Section 17.2 (Termination for Cause), we will refund you any prepaid fees covering the remainder of the then-current Subscription Term after the effective date of termination.", "If we terminate these Terms in accordance with Section 17.2 (Termination for Cause), you will pay any unpaid fees covering the remainder of the then-current Subscription Term after the effective date of termination.", "In no event will termination relieve you of your obligation to pay any fees payable to us for the period prior to the effective date of termination.", "Except where an exclusive remedy may be specified in these Terms, the exercise by either party of any remedy, including termination, will be without prejudice to any other remedies it may have under these Terms, by law or otherwise.", "17.5.", "Survival.", "The following provisions will survive any termination or expiration of these Terms: Sections 3.3 (Restrictions), 5.4 (Your Indemnity), 6.1 (Third-Party Products), 9.4 (Payment), 11 (Taxes not included), 14 (Evaluations, trials, and betas) (disclaimers and use restrictions only), 15 (IP Rights in the Cloud Products and Feedback), 16 (Confidentiality), 17 (Term and Termination), 18.4 (Warranty Disclaimer), 19 (Limitations of Liability), 20 (IP Indemnification) (but solely with respect to claims arising from your use of Cloud Products during the Subscription Term), 22 (Dispute Resolution) and 26 (General Provisions).", "18 Warranties and Disclaimer.", "18.1.", "Mutual Warranties.", "Each party represents and warrants that it has the legal power and authority to enter into these Terms.", "18.2.", "Our Warranties.", "We warrant, for your benefit only, that we use commercially reasonable efforts to prevent introduction of viruses, Trojan horses or similar harmful materials into the Cloud Products (but we are not responsible for harmful materials submitted by you or End Users) (the “Performance Warranty”).", "18.3.", "Warranty Remedy.", "We will use commercially reasonable efforts, at no charge to you, to correct reported non-conformities with the Performance Warranty.", "If we determine corrections to be impracticable, either party may terminate the applicable Subscription Term.", "In this case, you will receive a refund of any fees you have pre-paid for use of the Cloud Product for the terminated portion of the applicable Subscription Term.", "The Performance Warranty will not apply: (i) unless you make a claim within thirty (30) days of the date on which you first noticed the non-conformity, (ii) if the non-conformity was caused by misuse, unauthorized modifications or third-party products, software, services or equipment or (iii) to No-Charge Products.", "Our sole liability, and your sole and exclusive remedy, for any breach of the Performance Warranty are set forth in this Section 18.", "18.4.", "WARRANTY DISCLAIMER.", "EXCEPT AS EXPRESSLY PROVIDED IN THIS SECTION 18, ALL CLOUD PRODUCTS, SUPPORT AND ADDITIONAL SERVICES ARE PROVIDED “AS IS,” AND WE AND OUR SUPPLIERS EXPRESSLY DISCLAIM ANY AND ALL WARRANTIES AND REPRESENTATIONS OF ANY KIND, INCLUDING ANY WARRANTY OF NON-INFRINGEMENT, TITLE, FITNESS FOR A PARTICULAR PURPOSE, FUNCTIONALITY OR MERCHANTABILITY, WHETHER EXPRESS, IMPLIED OR STATUTORY.", "WITHOUT LIMITING OUR EXPRESS OBLIGATIONS IN THESE TERMS, WE DO NOT WARRANT THAT YOUR USE OF THE CLOUD PRODUCTS WILL BE UNINTERRUPTED OR ERROR-FREE, THAT WE WILL REVIEW YOUR DATA FOR ACCURACY OR THAT WE WILL PRESERVE OR MAINTAIN YOUR DATA WITHOUT LOSS.", "YOU UNDERSTAND THAT USE OF THE CLOUD PRODUCTS NECESSARILY INVOLVES TRANSMISSION OF YOUR DATA OVER NETWORKS THAT WE DO NOT OWN, OPERATE OR CONTROL, AND WE ARE NOT RESPONSIBLE FOR ANY OF YOUR DATA LOST, ALTERED, INTERCEPTED OR STORED ACROSS SUCH NETWORKS.", "WE CANNOT GUARANTEE THAT OUR SECURITY PROCEDURES WILL BE ERROR-FREE, THAT TRANSMISSIONS OF YOUR DATA WILL ALWAYS BE SECURE OR THAT UNAUTHORIZED THIRD PARTIES WILL NEVER BE ABLE TO DEFEAT OUR SECURITY MEASURES OR THOSE OF OUR THIRD PARTY SERVICE PROVIDERS.", "WE WILL NOT BE LIABLE FOR DELAYS, INTERRUPTIONS, SERVICE FAILURES OR OTHER PROBLEMS INHERENT IN USE OF THE INTERNET AND ELECTRONIC COMMUNICATIONS OR OTHER SYSTEMS OUTSIDE OUR REASONABLE CONTROL.", "YOU MAY HAVE OTHER STATUTORY RIGHTS, BUT THE DURATION OF STATUTORILY REQUIRED WARRANTIES, IF ANY, WILL BE LIMITED TO THE SHORTEST PERIOD PERMITTED BY LAW.", "19.", "Limitation of Liability.", "19.1.", "Consequential Damages Waiver.", "EXCEPT FOR EXCLUDED CLAIMS (AS DEFINED BELOW), NEITHER PARTY (NOR ITS SUPPLIERS) WILL HAVE ANY LIABILITY ARISING OUT OF OR RELATED TO THESE TERMS FOR ANY LOSS OF USE, LOST OR INACCURATE DATA, LOST PROFITS, FAILURE OF SECURITY MECHANISMS, INTERRUPTION OF BUSINESS, COSTS OF DELAY, OR ANY INDIRECT, SPECIAL, INCIDENTAL, RELIANCE OR CONSEQUENTIAL DAMAGES OF ANY KIND, EVEN IF INFORMED OF THE POSSIBILITY OF SUCH DAMAGES IN ADVANCE.", "19.2.", "Liability Cap.", "EXCEPT FOR EXCLUDED CLAIMS, EACH PARTY’S AND ITS SUPPLIERS’ AGGREGATE LIABILITY TO THE OTHER ARISING OUT OF OR RELATED TO THESE TERMS WILL NOT EXCEED THE AMOUNT ACTUALLY PAID OR PAYABLE BY YOU TO US UNDER THESE TERMS IN THE TWELVE (12) MONTHS IMMEDIATELY PRECEDING THE CLAIM.", "19.3.", "Excluded Claims.", "“Excluded Claims” means (1) amounts owed by you under any Orders, (2) either party’s express indemnification obligations in these Terms, and (3) your breach of Section 3.3 (Restrictions) or of Section 2 (Combining the Products with Open Source Software) of Third Party Code in Atlassian Products.", "19.4.", "Nature of Claims and Failure of Essential Purpose.", "The parties agree that the waivers and limitations specified in this Section 19 apply regardless of the form of action, whether in contract, tort (including negligence), strict liability or otherwise and will survive and apply even if any limited remedy specified in these Terms is found to have failed of its essential purpose.", "20.", "IP Indemnification.", "We will defend you against any claim brought against you by a third party alleging that the Cloud Products, when used as authorized under these Terms, infringe a patent right granted in the United States, Australia or a member nation of the European Union or a copyright registered in such a jurisdiction (a “Claim”), and we will indemnify you and hold you harmless against any damages and costs finally awarded on the Claim by a court of competent jurisdiction or agreed to via settlement executed by us (including reasonable attorneys’ fees), provided that we have received from you: (a) prompt written notice of the Claim (but in any event notice in sufficient time for us to respond without prejudice); (b) reasonable assistance in the defense and investigation of the Claim, including providing us a copy of the Claim, all relevant evidence in your possession, custody, or control, and cooperation with evidentiary discovery, litigation, and trial, including making witnesses within your employ or control available for testimony; and (c) the exclusive right to control and direct the investigation, defense, and settlement (if applicable) of the Claim.", "If your use of the Cloud Products is (or in your opinion is likely to be) enjoined, whether by court order or by settlement, or if we determine such actions are reasonably necessary to avoid material liability, we may, at our option and in our discretion: (i) procure the right for your continued use of the Cloud Product in accordance with these Terms; (ii) substitute a substantially functionally similar Cloud Product; or (iii) terminate your right to continue using the Cloud Product and refund any prepaid amounts for the terminated portion of the Subscription Term.", "Our indemnification obligations above do not apply: (1) if the total aggregate fees we receive with respect to your subscription to a Cloud Product in the twelve (12) month period immediately preceding the Claim is less than US$50,000; (2) if the Cloud Product is modified by any party other than us, but solely to the extent the alleged infringement is caused by such modification; (3) if the Cloud Product is used in combination with any non-Atlassian product, software, service or equipment, but solely to the extent the alleged infringement is caused by such combination; (4) to unauthorized use of Cloud Products; (5) to any Claim arising as a result of (y) Your Data or circumstances covered by your indemnification obligations in Section 5.4 (Your Indemnity) or (z) any third-party deliverables or components contained with the Cloud Products or (6) if you settle or make any admissions with respect to a Claim without our prior written consent.", "THIS SECTION 20 (IP INDEMNIFICATION) STATES OUR SOLE LIABILITY AND YOUR EXCLUSIVE REMEDY FOR ANY INFRINGEMENT OF INTELLECTUAL PROPERTY RIGHTS IN CONNECTION WITH ANY CLOUD PRODUCT OR OTHER ITEMS WE PROVIDE UNDER THESE TERMS.", "21.", "Publicity Rights.", "We may identify you as an Atlassian customer in our promotional materials.", "We will promptly stop doing so upon your request sent to sales@atlassian.com.", "22.", "Dispute Resolution.", "22.1.", "Informal Resolution.", "In the event of any controversy or claim arising out of or relating to these Terms, the parties will consult and negotiate with each other and, recognizing their mutual interests, attempt to reach a solution satisfactory to both parties.", "If the parties do not reach settlement within a period of sixty (60) days, either party may pursue relief as may be available under these Terms pursuant to Section 22.2 (Governing Law; Jurisdiction).", "All negotiations pursuant to this Section 22.1 will be confidential and treated as compromise and settlement negotiations for purposes of all rules and codes of evidence of applicable legislation and jurisdictions.", "22.2.", "Governing Law; Jurisdiction.", "These Terms will be governed by and construed in accordance with the applicable laws of the State of California, USA, without giving effect to the principles of that State relating to conflicts of laws.", "Each party irrevocably agrees that any legal action, suit or proceeding arising out of or related to these Terms must be brought solely and exclusively in, and will be subject to the service of process and other applicable procedural rules of, the State or Federal court in San Francisco, California, USA, and each party irrevocably submits to the sole and exclusive personal jurisdiction of the courts in San Francisco, California, USA, generally and unconditionally, with respect to any action, suit or proceeding brought by it or against it by the other party.", "In any action or proceeding to enforce a party’s rights under these Terms, the prevailing party will be entitled to recover its reasonable costs and attorneys’ fees.", "22.3.", "Injunctive Relief; Enforcement.", "Notwithstanding the provisions of Section 22.1 (Informal Resolution) and 22.2 (Governing Law; Jurisdiction), nothing in these Terms will prevent us from seeking injunctive relief with respect to a violation of intellectual property rights, confidentiality obligations or enforcement or recognition of any award or order in any appropriate jurisdiction.", "22.4.", "Exclusion of UN Convention and UCITA.", "The terms of the United Nations Convention on Contracts for the Sale of Goods do not apply to these Terms.", "The Uniform Computer Information Transactions Act (UCITA) will not apply to these Terms regardless of when or where adopted.", "23.", "Export Restrictions.", "The Cloud Products are subject to export restrictions by the United States government and may be subject to import restrictions by certain foreign governments, and you agree to comply with all applicable export and import laws and regulations in your access to, use of, and download of the Cloud Products (or any part thereof).", "You shall not (and shall not allow any third-party to) remove or export from the United States or allow the export or re-export of any part of the Cloud Products or any direct product thereof: (a) into (or to a national or resident of) any embargoed or terrorist-supporting country; (b) to anyone on the U.S. Commerce Department’s Denied Persons, Entity, or Unverified Lists or the U.S. Treasury Department’s list of Specially Designated Nationals and Consolidated Sanctions list (collectively, “Prohibited Persons”); (c) to any country to which such export or re-export is restricted or prohibited, or as to which the United States government or any agency thereof requires an export license or other governmental approval at the time of export or re-export without first obtaining such license or approval; or (d) otherwise in violation of any export or import restrictions, laws or regulations of any United States or foreign agency or authority.", "You represent and warrant that (i) you are not located in, under the control of, or a national or resident of any such prohibited country and (ii) none of Your Data is controlled under the U.S. International Traffic in Arms Regulations or similar Laws in other jurisdictions.", "You also certify that you are not a Prohibited Person nor owned, controlled by, or acting on behalf of a Prohibited Person.", "You agree not to use or provide the Cloud Products for any prohibited end use, including to support any nuclear, chemical, or biological weapons proliferation, or missile technology, without the prior permission of the United States government.", "24.", "Changes to these Terms.", "We may modify the terms and conditions of these Terms (including Our Policies) from time to time, with notice to you in accordance with Section 26.1 (Notices) or by posting the modified Terms on our website.", "Together with notice, we will specify the effective date of the modifications.", "24.1.", "No-Charge Products.", "You must accept the modifications to continue using the No-Charge Products.", "If you object to the modifications, your exclusive remedy is to cease using the No-Charge Products.", "24.2.", "Paid Subscriptions.", "Except as otherwise indicated below, modifications to these Terms will take effect at the next renewal of your Subscription Term and will automatically apply as of the renewal date unless you elect not to renew pursuant to Section 9.2 (Renewals).", "Notwithstanding the foregoing, in some cases (e.g., to address compliance with Laws, or as necessary for new features) we may specify that such modifications become effective during your then-current Subscription Term.", "If the effective date of such modifications is during your then-current Subscription Term and you object to the modifications, then (as your exclusive remedy) you may terminate your affected Orders upon notice to us, and we will refund you any fees you have pre-paid for use of the affected Cloud Products for the terminated portion of the applicable Subscription Term.", "To exercise this right, you must provide us with notice of your objection and termination within thirty (30) days of us providing notice of the modifications.", "For the avoidance of doubt, any Order is subject to the version of these Terms in effect at the time of the Order.", "24.3.", "Our Policies.", "We may modify Our Policies to take effect during your then-current Subscription Term in order to respond to changes in our products, our business, or Laws.", "In this case, unless required by Laws, we agree not to make modifications to Our Policies that, considered as a whole, would substantially diminish our obligations during your then-current Subscription Term.", "Modifications to Our Policies will take effect automatically as of the effective date specified for the updated policies.", "25.", "Changes to the Cloud Products.", "You acknowledge that the Cloud Products are on-line, subscription-based products, and that in order to provide improved customer experience we may make changes to the Cloud Products, and we may update the applicable Documentation accordingly.", "Subject to our obligation to provide Cloud Products and Additional Services under existing Orders, we can discontinue any Cloud Products, any Additional Services, or any portion or feature of any Cloud Products for any reason at any time without liability to you.", "26.", "General Provisions.", "26.1.", "Notices.", "Any notice under these Terms must be given in writing.", "We may provide notice to you through your Notification Email Address, your account or in-product notifications.", "You agree that any electronic communication will satisfy any applicable legal communication requirements, including that such communications be in writing.", "Any notice to you will be deemed given upon the first business day after we send it.", "You will provide notice to us by post to Atlassian Pty Ltd, c/o Atlassian, Inc., 350 Bush Street, Floor 13, San Francisco, CA, USA 94104, Attn: General Counsel.", "Your notices to us will be deemed given upon receipt.", "26.2.", "Force Majeure.", "Neither party will be liable to the other for any delay or failure to perform any obligation under these Terms (except for a failure to pay fees) if the delay or failure is due to events which are beyond the reasonable control of such party, such as a strike, blockade, war, act of terrorism, riot, natural disaster, failure or diminishment of power or telecommunications or data networks or services, or refusal of a license by a government agency.", "26.3.", "Assignment.", "You may not assign or transfer these Terms without our prior written consent.", "As an exception to the foregoing, you may assign these Terms in their entirety (including all Orders) to your successor resulting from a merger, acquisition, or sale of all or substantially all of your assets or voting securities, provided that you provide us with prompt written notice of the assignment and the assignee agrees in writing to assume all of your obligations under these Terms.", "Any attempt by you to transfer or assign these Terms except as expressly authorized above will be null and void.", "We may assign our rights and obligations under these Terms (in whole or in part) without your consent.", "We may also permit our Affiliates, agents and contractors to exercise our rights or perform our obligations under these Terms, in which case we will remain responsible for their compliance with these Terms.", "Subject to the foregoing, these Terms will inure to the parties’ permitted successors and assigns.", "26.4.", "Government End Users.", "Any United States federal, state, or local government customers are subject to the Government Amendment in addition to these Terms.", "26.5.", "Entire Agreement.", "These Terms are the entire agreement between you and us relating to the Cloud Products and any other subject matter covered by these Terms, and supersede all prior or contemporaneous oral or written communications, proposals and representations between you and us with respect to the Cloud Products or any other subject matter covered by these Terms.", "No provision of any purchase order or other business form employed by you will supersede or supplement the terms and conditions of these Terms, and any such document relating to these Terms will be for administrative purposes only and will have no legal effect.", "26.6.", "Conflicts.", "In event of any conflict between the main body of these Terms and either Our Policies or Product-Specific Terms, Our Policies or Product-Specific Terms (as applicable) will control with respect to their subject matter.", "26.7.", "Waivers; Modifications.", "No failure or delay by the injured party to these Terms in exercising any right, power or privilege hereunder will operate as a waiver thereof, nor will any single or partial exercise thereof preclude any other or further exercise thereof or the exercise of any right, power or privilege hereunder at law or equity.", "Except as set forth in Section 24 (Changes to these Terms), any amendments or modifications to these Terms must be executed in writing by an authorized representative of each party.", "26.8.", "Interpretation.", "As used herein, “including” (and its variants) means “including without limitation” (and its variants).", "Headings are for convenience only.", "If any provision of these Terms is held to be void, invalid, unenforceable or illegal, the other provisions will continue in full force and effect.", "26.9.", "Independent Contractors.", "The parties are independent contractors.", "These Terms will not be construed as constituting either party as a partner of the other or to create any other form of legal association that would give either party the express or implied right, power or authority to create any duty or obligation of the other party.", "27.", "Definitions.", "Certain capitalized terms are defined in this Section 27, and others are defined contextually in these Terms.", "“Additional Services” means Technical Account Manager (TAM) services, premier or priority support or other services related to the Cloud Products we provide to you, as identified in an Order.", "For the avoidance of doubt, Additional Services do not include the standard level of support included in your subscription.", "“Administrators” mean the personnel designated by you who administer the Cloud Products to End Users on your behalf.", "“Affiliate” means an entity which, directly or indirectly, owns or controls, is owned or is controlled by or is under common ownership or control with a party, where “control” means the power to direct the management or affairs of an entity, and “ownership” means the beneficial ownership of greater than 50% of the voting equity securities or other equivalent voting interests of the entity.", "“Cloud Products” means our hosted or cloud-based solutions (currently designated as “Cloud” deployments), including any client software we provide as part of the Cloud Products.", "“Documentation” means our standard published documentation for the Cloud Products, currently located here.", "“End User” means an individual you or an Affiliate permits or invites to use the Cloud Products.", "For the avoidance of doubt:  (a) individuals invited by your End Users, (b) individuals under managed accounts, and (c) individuals interacting with a Cloud Product as your customer are also considered End Users.", "“End User Account” means an account established by you or an End User to enable the End User to use or access a Cloud Product.", "“Feedback” means comments, questions, ideas, suggestions or other feedback relating to the Cloud Products, Support or Additional Services.", "“HIPAA” means the Health Insurance Portability and Accountability Act, as amended and supplemented.", "“Laws” means all applicable local, state, federal and international laws, regulations and conventions, including those related to data privacy and data transfer, international communications and the exportation of technical or personal data.", "“Notification Email Address” means the email address(es) you used to register for a Cloud Product account or otherwise sign up for a Cloud Product.", "It is your responsibility to keep your email address(es) valid and current so that we are able to send notices, statements, and other information to you.", "“Order” means Atlassian’s applicable online order page(s), flows, in-product screens or other Atlassian-approved ordering document or process describing the products and services you are ordering from us and, as applicable, their permitted scope of use.", "As applicable, the Order will identify: (i) the Cloud Products, (ii) the number of End Users, Subscription Term, domain(s) associated with your use of Cloud Products, storage capacity or limits, or other scope of use parameters and (iii) (for paid Orders) the amount or rate you will be charged, the billing and renewal terms, applicable currency, and form of payment.", "Orders may also include Additional Services and No-Charge Products.", "“Our Deliverables” means any materials, deliverables, modifications, derivative works or developments that we provide in connection with any Additional Services.", "“Our Policies” means our Acceptable Use Policy, guidelines for Reporting Copyright and Trademark Violations, Online Community Platforms Terms of Use, Privacy Policy, Support Policy, Enterprise Support and Services Policy, terms for Third Party Code in Atlassian Products, and (unless specified) any other policies or terms referenced in these Terms.", "“Our Technology” means the Cloud Products (including all No-Charge Products), Our Deliverables, their “look and feel”, any and all related or underlying technology and any modifications or derivative works of the foregoing, including as they may incorporate Feedback.", "“PCI DSS” means the Payment Card Industry Data Security Standards.", "“PO” means a purchase order.", "“Product-Specific Terms” means additional terms that apply to certain Cloud Products and Additional Services, currently located here.", "“Sensitive Data” means any (i) categories of data enumerated in European Union Regulation 2016/679, Article 9(1) or any successor legislation; (ii) patient, medical or other protected health information regulated by HIPAA; (iii) credit, debit or other payment card data subject to PCI DSS; (iv) other information subject to regulation or protection under specific laws such as the Gramm-Leach-Bliley Act (or related rules or regulations); (v) social security numbers, driver’s license numbers or other government ID numbers; or (vi) any data similar to the foregoing that is protected under foreign or domestic laws or regulations.", "“Subscription Term” means your permitted subscription period for a Cloud Product, as set forth in the applicable Order.", "“Support” means support for the Cloud Products, as further described in the Support Policy and Enterprise Support and Services Policy (to the extent applicable).", "Your Support level will be specified in the applicable Order.", "“Training” means Atlassian-provided training and certification services.", "“Your Data” means any data, content, code, video, images or other materials of any type that you (including any of your End Users) submit to Cloud Products.", "In this context, “submit” (and any similar term) includes submitting, uploading, transmitting or otherwise making available Your Data to or through the Cloud Products.", "“Your Materials” means your materials, systems, personnel or other resources."], "features": [[4, 0, 0.0, 0.0, 4, 0, 0.0, 0.0009230433843860275], [5, 1, 0.0021691973969631237, 0.0, 2, 0, 0.008, 0.00010480391248738457], [3, 0, 0.004338394793926247, 0.0, 4, 0, 0.016, 0.011723782917449892], [11, 0, 0.006507592190889371, 0.125, 8, 0, 0.016, 0.00021254334359996927], [18, 2, 0.008676789587852495, 0.25, 11, 0, 0.016, 6.169748673549063e-05], [10, 1, 0.010845986984815618, 0.375, 6, 0, 0.016, 8.447801977745442e-11], [7, 2, 0.013015184381778741, 0.5, 2, 0, 0.016, 1.692082502772647e-05], [23, 1, 0.015184381778741865, 0.625, 4, 0, 0.016, 5.5076023206334065e-06], [12, 0, 0.01735357917570499, 0.75, 2, 1, 0.016, 1.9727947208965335e-10], [22, 3, 0.019522776572668113, 0.875, 62, 62, 0.016, 9.944347795924622e-06], [15, 1, 0.021691973969631236, 0.0, 7, 1, 0.024, 2.3661657976503664e-05], [4, 0, 0.02386117136659436, 0.25, 2, 0, 0.024, 0.00014904256825525158], [17, 2, 0.026030368763557483, 0.5, 8, 1, 0.024, 3.74953492438919e-05], [8, 1, 0.028199566160520606, 0.75, 6, 0, 0.024, 0.000227674746377034], [1, 0, 0.03036876355748373, 0.0, 0, 0, 0.032, 0.002807104784482412], [2, 0, 0.03253796095444685, 0.5, 2, 0, 0.032, 0.026030855894629397], [1, 0, 0.03470715835140998, 0.0, 0, 0, 0.04, 0.0014464694624057237], [2, 0, 0.0368763557483731, 0.25, 2, 0, 0.04, 0.021197292496406187], [8, 2, 0.039045553145336226, 0.5, 7, 0, 0.04, 0.00021648189825435336], [9, 2, 0.04121475054229935, 0.75, 9, 0, 0.04, 5.302906499934056e-05], [1, 0, 0.04338394793926247, 0.0, 0, 0, 0.048, 0.0018184264027004949], [2, 0, 0.0455531453362256, 0.25, 2, 0, 0.048, 0.02087054632136893], [10, 0, 0.04772234273318872, 0.5, 5, 0, 0.048, 0.00026717139573046876], [8, 1, 0.049891540130151846, 0.75, 5, 0, 0.048, 0.0004482175725487013], [1, 0, 0.052060737527114966, 0.0, 0, 0, 0.056, 0.0014464694624057237], [3, 0, 0.05422993492407809, 0.25, 4, 0, 0.056, 0.0031218089049866696], [14, 1, 0.05639913232104121, 0.5, 5, 0, 0.056, 5.66545195857862e-10], [13, 3, 0.05856832971800434, 0.75, 4, 0, 0.056, 0.00011845056900367703], [1, 0, 0.06073752711496746, 0.0, 0, 0, 0.064, 0.0029104405126884306], [3, 0, 0.06290672451193059, 0.5, 3, 0, 0.064, 0.006094276887765141], [1, 0, 0.0650759219088937, 0.0, 0, 0, 0.072, 0.0010419717440907023], [1, 0, 0.06724511930585683, 0.14285714285714285, 1, 0, 0.072, 0.003609134722905958], [13, 2, 0.06941431670281996, 0.2857142857142857, 11, 0, 0.072, 3.409184111403698e-05], [26, 3, 0.07158351409978309, 0.42857142857142855, 14, 0, 0.072, 3.7797474233067796e-11], [12, 1, 0.0737527114967462, 0.5714285714285714, 2, 0, 0.072, 1.5785283093736447e-05], [13, 3, 0.07592190889370933, 0.7142857142857143, 7, 0, 0.072, 1.2396240138699501e-11], [8, 0, 0.07809110629067245, 0.8571428571428571, 3, 0, 0.072, 1.0613267989399029e-07], [1, 0, 0.08026030368763558, 0.0, 0, 0, 0.08, 0.0014464694624057237], [2, 0, 0.0824295010845987, 0.25, 2, 0, 0.08, 0.003816218240159418], [15, 1, 0.08459869848156182, 0.5, 7, 0, 0.08, 2.5147480211672806e-05], [9, 1, 0.08676789587852494, 0.75, 6, 0, 0.08, 8.12060544104536e-05], [1, 0, 0.08893709327548807, 0.0, 0, 0, 0.088, 0.0014464694624057237], [3, 0, 0.0911062906724512, 0.25, 3, 0, 0.088, 0.003228837237302841], [22, 0, 0.09327548806941431, 0.5, 13, 0, 0.088, 2.4507425949585185e-05], [5, 0, 0.09544468546637744, 0.75, 1, 0, 0.088, 0.00020698405017472753], [1, 0, 0.09761388286334056, 0.0, 0, 0, 0.096, 0.002494663296590083], [3, 0, 0.09978308026030369, 0.09090909090909091, 3, 0, 0.096, 0.004534691610036199], [5, 0, 0.1019522776572668, 0.18181818181818182, 3, 0, 0.096, 0.00021049660068343275], [16, 0, 0.10412147505422993, 0.2727272727272727, 4, 0, 0.096, 4.232936173325429e-05], [9, 0, 0.10629067245119306, 0.36363636363636365, 5, 0, 0.096, 0.0001206971081496989], [22, 2, 0.10845986984815618, 0.45454545454545453, 13, 0, 0.096, 4.818848654889509e-05], [19, 2, 0.11062906724511931, 0.5454545454545454, 10, 0, 0.096, 2.26110214951242e-05], [8, 1, 0.11279826464208242, 0.6363636363636364, 4, 0, 0.096, 0.0001271913007495479], [15, 2, 0.11496746203904555, 0.7272727272727273, 10, 0, 0.096, 1.1642800145468071e-05], [12, 3, 0.11713665943600868, 0.8181818181818182, 7, 0, 0.096, 1.0350538578013483e-05], [22, 1, 0.1193058568329718, 0.9090909090909091, 12, 1, 0.096, 6.316964017977763e-14], [1, 0, 0.12147505422993492, 0.0, 0, 0, 0.104, 0.0010419717440907023], [1, 0, 0.12364425162689804, 0.2, 1, 0, 0.104, 0.0005873651434155784], [14, 0, 0.12581344902386118, 0.4, 6, 0, 0.104, 9.575742344676128e-06], [7, 1, 0.1279826464208243, 0.6, 2, 0, 0.104, 1.1994042911928089e-05], [11, 1, 0.1301518438177874, 0.8, 4, 0, 0.104, 4.854285238073787e-06], [1, 0, 0.13232104121475055, 0.0, 0, 0, 0.112, 0.0014464694624057237], [4, 0, 0.13449023861171366, 0.25, 4, 0, 0.112, 0.0015770127412787415], [5, 2, 0.13665943600867678, 0.5, 3, 0, 0.112, 0.00011412105655916165], [6, 0, 0.13882863340563992, 0.75, 3, 0, 0.112, 1.1683090884743622e-06], [1, 0, 0.14099783080260303, 0.0, 0, 0, 0.12, 0.0014464694624057237], [2, 0, 0.14316702819956617, 0.25, 3, 0, 0.12, 0.002663531546934056], [11, 1, 0.14533622559652928, 0.5, 5, 0, 0.12, 2.2134160439864524e-05], [9, 1, 0.1475054229934924, 0.75, 5, 0, 0.12, 8.55017566039847e-05], [1, 0, 0.14967462039045554, 0.0, 0, 0, 0.128, 0.0018184264027004949], [5, 0, 0.15184381778741865, 0.5, 3, 0, 0.128, 0.00016970943594311083], [1, 0, 0.1540130151843818, 0.0, 0, 0, 0.136, 0.0010419717440907023], [3, 0, 0.1561822125813449, 0.2, 3, 0, 0.136, 0.009628690147539233], [17, 4, 0.15835140997830802, 0.4, 9, 0, 0.136, 7.884360955872692e-06], [10, 2, 0.16052060737527116, 0.6, 5, 0, 0.136, 0.0002623043343420367], [7, 1, 0.16268980477223427, 0.8, 2, 0, 0.136, 1.286549039919594e-05], [1, 0, 0.1648590021691974, 0.0, 0, 0, 0.144, 0.0005873651434155784], [1, 0, 0.16702819956616052, 0.3333333333333333, 1, 0, 0.144, 0.007080657274562716], [17, 3, 0.16919739696312364, 0.6666666666666666, 13, 0, 0.144, 4.200611335057672e-05], [1, 0, 0.17136659436008678, 0.0, 0, 0, 0.152, 0.0018184264027004949], [1, 0, 0.1735357917570499, 0.3333333333333333, 1, 0, 0.152, 0.0041464261467372785], [90, 15, 0.175704989154013, 0.6666666666666666, 21, 0, 0.152, 3.834343993211714e-07], [1, 0, 0.17787418655097614, 0.0, 0, 0, 0.16, 0.0014464694624057237], [4, 0, 0.18004338394793926, 0.5, 1, 0, 0.16, 0.0011696005086930406], [1, 0, 0.1822125813449024, 0.0, 0, 0, 0.168, 0.0005873651434155784], [1, 0, 0.1843817787418655, 0.3333333333333333, 1, 0, 0.168, 0.004402295723192013], [8, 0, 0.18655097613882862, 0.6666666666666666, 3, 0, 0.168, 2.9679055275765703e-05], [1, 0, 0.18872017353579176, 0.0, 0, 0, 0.176, 0.0005873651434155784], [1, 0, 0.19088937093275488, 0.25, 1, 0, 0.176, 0.0041927753367374376], [12, 0, 0.19305856832971802, 0.5, 8, 0, 0.176, 0.0001391287551781224], [7, 1, 0.19522776572668113, 0.75, 3, 0, 0.176, 3.8108662476060915e-05], [1, 0, 0.19739696312364424, 0.0, 0, 0, 0.184, 0.0005873651434155784], [3, 0, 0.19956616052060738, 0.2, 3, 0, 0.184, 0.013505380806066399], [4, 0, 0.2017353579175705, 0.4, 3, 0, 0.184, 0.003725753003207718], [6, 1, 0.2039045553145336, 0.6, 3, 0, 0.184, 1.8383940393306916e-08], [8, 1, 0.20607375271149675, 0.8, 3, 0, 0.184, 0.00011744464947987526], [1, 0, 0.20824295010845986, 0.0, 0, 0, 0.192, 0.0005873651434155784], [1, 0, 0.210412147505423, 0.25, 1, 0, 0.192, 0.0010419717440907023], [15, 2, 0.21258134490238612, 0.5, 4, 0, 0.192, 1.4716457400801634e-12], [22, 1, 0.21475054229934923, 0.75, 6, 0, 0.192, 3.3675612520676824e-06], [1, 0, 0.21691973969631237, 0.0, 0, 0, 0.2, 0.0005873651434155784], [4, 0, 0.21908893709327548, 0.3333333333333333, 4, 1, 0.2, 0.0006911065618309157], [20, 3, 0.22125813449023862, 0.6666666666666666, 13, 2, 0.2, 7.873191454015366e-09], [1, 0, 0.22342733188720174, 0.0, 0, 0, 0.208, 0.0010419717440907023], [3, 0, 0.22559652928416485, 0.5, 3, 0, 0.208, 0.0025760903898289947], [1, 0, 0.227765726681128, 0.0, 0, 0, 0.216, 0.0005873651434155784], [4, 0, 0.2299349240780911, 0.16666666666666666, 6, 0, 0.216, 1.4555005051102639e-05], [8, 1, 0.23210412147505424, 0.3333333333333333, 5, 0, 0.216, 0.00043471586958991485], [20, 10, 0.23427331887201736, 0.5, 6, 0, 0.216, 3.497828194297507e-05], [18, 1, 0.23644251626898047, 0.6666666666666666, 5, 0, 0.216, 6.386308435120914e-06], [14, 2, 0.2386117136659436, 0.8333333333333334, 8, 0, 0.216, 1.2136686101351133e-05], [1, 0, 0.24078091106290672, 0.0, 0, 0, 0.224, 0.0010419717440907023], [3, 0, 0.24295010845986983, 0.2, 4, 0, 0.224, 0.0038457613827773893], [11, 1, 0.24511930585683298, 0.4, 10, 0, 0.224, 4.1481953952013626e-05], [35, 5, 0.2472885032537961, 0.6, 12, 0, 0.224, 1.137135964557812e-05], [19, 2, 0.24945770065075923, 0.8, 9, 0, 0.224, 6.558726544518602e-05], [1, 0, 0.25162689804772237, 0.0, 0, 0, 0.232, 0.0010419717440907023], [2, 0, 0.25379609544468545, 0.16666666666666666, 3, 0, 0.232, 0.01111719035302072], [8, 0, 0.2559652928416486, 0.3333333333333333, 7, 0, 0.232, 0.00028347570789827753], [8, 0, 0.25813449023861174, 0.5, 4, 1, 0.232, 2.845372821496551e-05], [6, 0, 0.2603036876355748, 0.6666666666666666, 6, 3, 0.232, 3.95466872546564e-05], [7, 1, 0.26247288503253796, 0.8333333333333334, 4, 0, 0.232, 0.00038855017237565817], [1, 0, 0.2646420824295011, 0.0, 0, 0, 0.24, 0.0014464694624057237], [1, 0, 0.2668112798264642, 0.25, 2, 0, 0.24, 0.0018184264027004949], [52, 9, 0.26898047722342733, 0.5, 20, 0, 0.24, 2.023340698159583e-06], [24, 1, 0.27114967462039047, 0.75, 1, 0, 0.24, 1.0197316149024902e-06], [1, 0, 0.27331887201735355, 0.0, 0, 0, 0.248, 0.0010419717440907023], [2, 0, 0.2754880694143167, 0.16666666666666666, 2, 0, 0.248, 0.0008312632615956971], [6, 0, 0.27765726681127983, 0.3333333333333333, 3, 0, 0.248, 0.0008641919420781616], [27, 4, 0.279826464208243, 0.5, 14, 0, 0.248, 3.143817260319336e-05], [21, 2, 0.28199566160520606, 0.6666666666666666, 5, 0, 0.248, 1.7519405283478215e-05], [10, 0, 0.2841648590021692, 0.8333333333333334, 6, 0, 0.248, 3.2986147692455554e-05], [1, 0, 0.28633405639913234, 0.0, 0, 0, 0.256, 0.0010419717440907023], [4, 0, 0.2885032537960954, 0.5, 3, 0, 0.256, 0.00273911916946286], [1, 0, 0.29067245119305857, 0.0, 0, 0, 0.264, 0.0014464694624057237], [2, 0, 0.2928416485900217, 0.09090909090909091, 2, 0, 0.264, 0.022404589466499564], [22, 3, 0.2950108459869848, 0.18181818181818182, 11, 0, 0.264, 2.2449378985998676e-05], [11, 0, 0.29718004338394793, 0.2727272727272727, 3, 0, 0.264, 5.092187393624623e-05], [24, 1, 0.2993492407809111, 0.36363636363636365, 13, 0, 0.264, 4.017340843184843e-05], [13, 3, 0.30151843817787416, 0.45454545454545453, 5, 0, 0.264, 2.2307230857420506e-05], [8, 0, 0.3036876355748373, 0.5454545454545454, 3, 0, 0.264, 0.0001217910280855769], [14, 1, 0.30585683297180044, 0.6363636363636364, 3, 0, 0.264, 5.684808305666525e-05], [10, 0, 0.3080260303687636, 0.7272727272727273, 3, 0, 0.264, 0.00013909047790709405], [10, 1, 0.31019522776572667, 0.8181818181818182, 1, 0, 0.264, 6.621418123048579e-05], [14, 2, 0.3123644251626898, 0.9090909090909091, 32, 32, 0.264, 3.228069230095309e-06], [1, 0, 0.31453362255965295, 0.0, 0, 0, 0.272, 0.0014464694624057237], [2, 0, 0.31670281995661603, 0.14285714285714285, 2, 0, 0.272, 0.00469581115818609], [15, 2, 0.3188720173535792, 0.2857142857142857, 15, 0, 0.272, 3.639578877455422e-05], [10, 0, 0.3210412147505423, 0.42857142857142855, 9, 0, 0.272, 4.946808291122671e-05], [9, 0, 0.3232104121475054, 0.5714285714285714, 7, 0, 0.272, 0.00037146805620040627], [11, 0, 0.32537960954446854, 0.7142857142857143, 9, 0, 0.272, 0.00023746950745163684], [18, 4, 0.3275488069414317, 0.8571428571428571, 16, 0, 0.272, 1.2835866771780027e-05], [1, 0, 0.3297180043383948, 0.0, 0, 0, 0.28, 0.0005873651434155784], [3, 0, 0.3318872017353579, 0.3333333333333333, 2, 0, 0.28, 0.0017906896572221517], [12, 2, 0.33405639913232105, 0.6666666666666666, 7, 0, 0.28, 2.9637672909972492e-05], [1, 0, 0.3362255965292842, 0.0, 0, 0, 0.288, 0.0005873651434155784], [2, 0, 0.3383947939262473, 0.5, 2, 0, 0.288, 0.009344675740286657], [1, 0, 0.3405639913232104, 0.0, 0, 0, 0.296, 0.0005873651434155784], [2, 0, 0.34273318872017355, 0.25, 2, 0, 0.296, 0.009344675740286657], [9, 1, 0.34490238611713664, 0.5, 5, 0, 0.296, 0.00016824042846830758], [11, 1, 0.3470715835140998, 0.75, 6, 0, 0.296, 6.632997816295503e-05], [1, 0, 0.3492407809110629, 0.0, 0, 0, 0.304, 0.0005873651434155784], [1, 0, 0.351409978308026, 0.2, 2, 0, 0.304, 0.003882273293048963], [4, 1, 0.35357917570498915, 0.4, 3, 0, 0.304, 0.0002449698412226092], [11, 1, 0.3557483731019523, 0.6, 7, 0, 0.304, 0.0002124672369669464], [9, 2, 0.3579175704989154, 0.8, 9, 0, 0.304, 4.79500619533672e-05], [1, 0, 0.3600867678958785, 0.0, 0, 0, 0.312, 0.0005873651434155784], [1, 0, 0.36225596529284165, 0.14285714285714285, 2, 0, 0.312, 0.00546772241881477], [8, 0, 0.3644251626898048, 0.2857142857142857, 5, 0, 0.312, 0.00021597802029952787], [8, 1, 0.3665943600867679, 0.42857142857142855, 5, 0, 0.312, 6.251386845569197e-13], [11, 2, 0.368763557483731, 0.5714285714285714, 11, 0, 0.312, 4.599416876395873e-05], [6, 0, 0.37093275488069416, 0.7142857142857143, 5, 0, 0.312, 0.0004273277239707729], [6, 0, 0.37310195227765725, 0.8571428571428571, 3, 0, 0.312, 6.019982273080942e-05], [1, 0, 0.3752711496746204, 0.0, 0, 0, 0.32, 0.0005873651434155784], [2, 0, 0.3774403470715835, 0.3333333333333333, 3, 0, 0.32, 0.002663531546934056], [9, 3, 0.3796095444685466, 0.6666666666666666, 5, 0, 0.32, 5.5593708566715306e-05], [1, 0, 0.38177874186550975, 0.0, 0, 0, 0.328, 0.0005873651434155784], [3, 2, 0.3839479392624729, 0.5, 1, 0, 0.328, 0.0010017495676167346], [1, 0, 0.38611713665943603, 0.0, 0, 0, 0.336, 0.0010419717440907023], [3, 0, 0.3882863340563991, 0.3333333333333333, 3, 0, 0.336, 0.00036945033848697647], [11, 1, 0.39045553145336226, 0.6666666666666666, 5, 0, 0.336, 2.986076946449793e-05], [1, 0, 0.3926247288503254, 0.0, 0, 0, 0.344, 0.0010419717440907023], [1, 0, 0.3947939262472885, 0.16666666666666666, 1, 0, 0.344, 0.0021661862415144756], [19, 2, 0.3969631236442516, 0.3333333333333333, 8, 0, 0.344, 2.6652327458118894e-05], [13, 1, 0.39913232104121477, 0.5, 3, 0, 0.344, 1.0310970464195995e-05], [11, 1, 0.40130151843817785, 0.6666666666666666, 1, 0, 0.344, 1.593943690755646e-05], [10, 0, 0.403470715835141, 0.8333333333333334, 3, 0, 0.344, 1.7519623653149803e-05], [1, 0, 0.40563991323210413, 0.0, 0, 0, 0.352, 0.0005873651434155784], [2, 0, 0.4078091106290672, 0.25, 2, 0, 0.352, 0.008914651876213044], [13, 2, 0.40997830802603036, 0.5, 5, 0, 0.352, 7.525424388069374e-05], [11, 2, 0.4121475054229935, 0.75, 4, 0, 0.352, 8.773679006064024e-05], [1, 0, 0.41431670281995664, 0.0, 0, 0, 0.36, 0.0010419717440907023], [1, 0, 0.4164859002169197, 0.14285714285714285, 1, 0, 0.36, 0.004684899769781641], [8, 1, 0.41865509761388287, 0.2857142857142857, 3, 0, 0.36, 0.00016803264809831187], [14, 1, 0.420824295010846, 0.42857142857142855, 5, 3, 0.36, 3.1077290683459256e-06], [14, 4, 0.4229934924078091, 0.5714285714285714, 5, 0, 0.36, 3.0988921766020376e-06], [20, 4, 0.42516268980477223, 0.7142857142857143, 11, 1, 0.36, 1.4770183188259668e-06], [17, 5, 0.42733188720173537, 0.8571428571428571, 1, 0, 0.36, 3.7927094095544715e-05], [1, 0, 0.42950108459869846, 0.0, 0, 0, 0.368, 0.0005873651434155784], [1, 0, 0.4316702819956616, 0.2, 1, 0, 0.368, 0.0010419717440907023], [12, 0, 0.43383947939262474, 0.4, 3, 0, 0.368, 5.855128197311585e-05], [8, 0, 0.4360086767895879, 0.6, 2, 0, 0.368, 1.0367752960236444e-05], [3, 0, 0.43817787418655096, 0.8, 2, 0, 0.368, 0.0013294440116976094], [1, 0, 0.4403470715835141, 0.0, 0, 0, 0.376, 0.0018184264027004949], [2, 0, 0.44251626898047725, 0.16666666666666666, 1, 0, 0.376, 0.004221023863367029], [29, 3, 0.44468546637744033, 0.3333333333333333, 13, 0, 0.376, 1.5477408383907377e-05], [13, 2, 0.44685466377440347, 0.5, 4, 0, 0.376, 6.364763647618558e-05], [13, 1, 0.4490238611713666, 0.6666666666666666, 6, 0, 0.376, 7.40588643680381e-05], [8, 0, 0.4511930585683297, 0.8333333333333334, 4, 0, 0.376, 0.00031277246975158063], [1, 0, 0.45336225596529284, 0.0, 0, 0, 0.384, 0.0014464694624057237], [2, 0, 0.455531453362256, 0.5, 1, 0, 0.384, 0.00294991875493007], [1, 0, 0.45770065075921906, 0.0, 0, 0, 0.392, 0.0005873651434155784], [1, 0, 0.4598698481561822, 0.2, 1, 0, 0.392, 0.003882273293048963], [13, 0, 0.46203904555314534, 0.4, 4, 0, 0.392, 1.0910121403173956e-05], [12, 1, 0.4642082429501085, 0.6, 2, 0, 0.392, 0.00013922693112150065], [30, 4, 0.46637744034707157, 0.8, 1, 0, 0.392, 2.6566956431759345e-12], [1, 0, 0.4685466377440347, 0.0, 0, 0, 0.4, 0.0005873651434155784], [2, 0, 0.47071583514099785, 0.16666666666666666, 2, 0, 0.4, 0.003160627237425075], [6, 0, 0.47288503253796094, 0.3333333333333333, 1, 0, 0.4, 0.00018242259741563024], [9, 2, 0.4750542299349241, 0.5, 1, 0, 0.4, 3.793718958598164e-09], [11, 2, 0.4772234273318872, 0.6666666666666666, 1, 0, 0.4, 6.924141535260395e-06], [9, 0, 0.4793926247288503, 0.8333333333333334, 1, 0, 0.4, 7.513381329680789e-06], [1, 0, 0.48156182212581344, 0.0, 0, 0, 0.408, 0.0018184264027004949], [2, 0, 0.4837310195227766, 0.3333333333333333, 2, 0, 0.408, 0.003816218240159418], [7, 0, 0.48590021691973967, 0.6666666666666666, 3, 0, 0.408, 0.00017227666095529526], [7, 2, 0.4880694143167028, 0.0, 3, 0, 0.416, 0.00011541589732504945], [8, 0, 0.49023861171366595, 0.5, 4, 0, 0.416, 8.881860850835357e-05], [10, 4, 0.4924078091106291, 0.0, 7, 0, 0.424, 1.070384775915657e-06], [9, 1, 0.4945770065075922, 0.5, 4, 0, 0.424, 1.8772188180899047e-09], [12, 2, 0.4967462039045553, 0.0, 4, 0, 0.432, 8.364755611730909e-10], [12, 1, 0.49891540130151846, 0.0, 3, 0, 0.44, 0.00013884036613329498], [1, 0, 0.5010845986984815, 0.0, 0, 0, 0.448, 0.0014464694624057237], [4, 0, 0.5032537960954447, 0.2, 1, 0, 0.448, 0.0008882795339763976], [11, 0, 0.5054229934924078, 0.4, 6, 0, 0.448, 9.368263825760908e-05], [17, 2, 0.5075921908893709, 0.6, 6, 0, 0.448, 3.717884408894204e-05], [24, 1, 0.5097613882863341, 0.8, 5, 0, 0.448, 5.071821681371188e-06], [1, 0, 0.5119305856832972, 0.0, 0, 0, 0.456, 0.0018184264027004949], [3, 2, 0.5140997830802603, 0.08333333333333333, 1, 0, 0.456, 0.00026049293602267557], [17, 3, 0.5162689804772235, 0.16666666666666666, 9, 0, 0.456, 8.716497669046519e-05], [13, 2, 0.5184381778741866, 0.25, 6, 0, 0.456, 0.00011846181048341944], [17, 3, 0.5206073752711496, 0.3333333333333333, 9, 0, 0.456, 8.604217531668599e-05], [9, 1, 0.5227765726681128, 0.4166666666666667, 3, 0, 0.456, 9.992044431938883e-09], [23, 4, 0.5249457700650759, 0.5, 9, 0, 0.456, 4.392436429788412e-05], [6, 0, 0.527114967462039, 0.5833333333333334, 3, 0, 0.456, 2.1274715603843557e-06], [13, 2, 0.5292841648590022, 0.6666666666666666, 6, 0, 0.456, 1.972832454951802e-05], [12, 1, 0.5314533622559653, 0.75, 7, 0, 0.456, 6.673165205616414e-05], [16, 3, 0.5336225596529284, 0.8333333333333334, 4, 0, 0.456, 2.7903893250463285e-05], [9, 1, 0.5357917570498916, 0.9166666666666666, 20, 20, 0.456, 9.669350267180403e-06], [1, 0, 0.5379609544468547, 0.0, 0, 0, 0.464, 0.0010419717440907023], [5, 0, 0.5401301518438177, 0.14285714285714285, 5, 1, 0.464, 0.0003806586134453976], [12, 2, 0.5422993492407809, 0.2857142857142857, 2, 0, 0.464, 1.028771098660613e-05], [12, 3, 0.544468546637744, 0.42857142857142855, 5, 0, 0.464, 0.00017597544382885833], [5, 1, 0.5466377440347071, 0.5714285714285714, 2, 0, 0.464, 3.507605611882531e-07], [18, 5, 0.5488069414316703, 0.7142857142857143, 2, 0, 0.464, 2.2743975359400874e-10], [14, 5, 0.5509761388286334, 0.8571428571428571, 6, 0, 0.464, 5.39491598846728e-10], [1, 0, 0.5531453362255966, 0.0, 0, 0, 0.472, 0.0025994234898173703], [1, 0, 0.5553145336225597, 0.1111111111111111, 1, 0, 0.472, 0.0025994234898173703], [42, 5, 0.5574837310195228, 0.2222222222222222, 12, 0, 0.472, 1.1823714438805555e-06], [11, 0, 0.559652928416486, 0.3333333333333333, 7, 0, 0.472, 4.864168109012237e-06], [20, 1, 0.561822125813449, 0.4444444444444444, 8, 0, 0.472, 4.998998233895791e-05], [27, 3, 0.5639913232104121, 0.5555555555555556, 11, 0, 0.472, 4.489534497082863e-06], [38, 0, 0.5661605206073753, 0.6666666666666666, 13, 0, 0.472, 5.710430359236746e-06], [21, 1, 0.5683297180043384, 0.7777777777777778, 7, 0, 0.472, 4.3296279281134725e-05], [22, 1, 0.5704989154013015, 0.8888888888888888, 9, 0, 0.472, 9.384659320073349e-06], [1, 0, 0.5726681127982647, 0.0, 0, 0, 0.48, 0.0010419717440907023], [2, 0, 0.5748373101952278, 0.5, 2, 0, 0.48, 0.007763618690624741], [1, 0, 0.5770065075921909, 0.0, 0, 0, 0.488, 0.0005873651434155784], [1, 0, 0.579175704989154, 0.3333333333333333, 1, 0, 0.488, 0.008535954773976569], [10, 0, 0.5813449023861171, 0.6666666666666666, 6, 0, 0.488, 0.000249529970643008], [1, 0, 0.5835140997830802, 0.0, 0, 0, 0.496, 0.0014464694624057237], [1, 0, 0.5856832971800434, 0.3333333333333333, 2, 0, 0.496, 0.006758809216628047], [37, 5, 0.5878524945770065, 0.6666666666666666, 4, 0, 0.496, 1.44829878962629e-09], [1, 0, 0.5900216919739696, 0.0, 0, 0, 0.504, 0.0005873651434155784], [2, 0, 0.5921908893709328, 0.3333333333333333, 2, 0, 0.504, 0.004846295097385115], [41, 4, 0.5943600867678959, 0.6666666666666666, 9, 0, 0.504, 1.2901607146320845e-06], [1, 0, 0.596529284164859, 0.0, 0, 0, 0.512, 0.0005873651434155784], [2, 0, 0.5986984815618221, 0.1111111111111111, 2, 0, 0.512, 0.0050006726074263595], [18, 3, 0.6008676789587852, 0.2222222222222222, 6, 0, 0.512, 8.985893381821425e-06], [3, 0, 0.6030368763557483, 0.3333333333333333, 1, 0, 0.512, 0.0003926441075635991], [21, 1, 0.6052060737527115, 0.4444444444444444, 14, 0, 0.512, 2.1583352075578334e-05], [17, 1, 0.6073752711496746, 0.5555555555555556, 7, 0, 0.512, 2.355568266853957e-05], [17, 1, 0.6095444685466378, 0.6666666666666666, 7, 0, 0.512, 2.355568266853957e-05], [12, 0, 0.6117136659436009, 0.7777777777777778, 1, 0, 0.512, 4.76765867612947e-05], [12, 4, 0.613882863340564, 0.8888888888888888, 3, 0, 0.512, 1.664007588280513e-09], [1, 0, 0.6160520607375272, 0.0, 0, 0, 0.52, 0.0005873651434155784], [1, 0, 0.6182212581344902, 0.3333333333333333, 1, 0, 0.52, 0.0005873651434155784], [58, 14, 0.6203904555314533, 0.6666666666666666, 33, 2, 0.52, 6.975546598735466e-07], [3, 0, 0.6225596529284165, 0.0, 2, 0, 0.528, 0.00048547962296057725], [1, 0, 0.6247288503253796, 0.0, 0, 0, 0.536, 0.0005873651434155784], [2, 0, 0.6268980477223427, 0.3333333333333333, 2, 0, 0.536, 0.0018735261762873965], [8, 0, 0.6290672451193059, 0.6666666666666666, 2, 0, 0.536, 0.0003162181100010433], [1, 0, 0.631236442516269, 0.0, 0, 0, 0.544, 0.0005873651434155784], [1, 0, 0.6334056399132321, 0.3333333333333333, 2, 0, 0.544, 0.002494663296590083], [23, 3, 0.6355748373101953, 0.6666666666666666, 8, 0, 0.544, 8.088592839870295e-06], [1, 0, 0.6377440347071583, 0.0, 0, 0, 0.552, 0.0010419717440907023], [2, 0, 0.6399132321041214, 0.14285714285714285, 2, 0, 0.552, 0.003857061729868615], [9, 2, 0.6420824295010846, 0.2857142857142857, 3, 0, 0.552, 6.064304968660188e-05], [8, 1, 0.6442516268980477, 0.42857142857142855, 3, 0, 0.552, 0.00018565081819265676], [12, 1, 0.6464208242950108, 0.5714285714285714, 5, 0, 0.552, 7.261531586703295e-05], [25, 4, 0.648590021691974, 0.7142857142857143, 5, 0, 0.552, 3.784234386352545e-05], [11, 2, 0.6507592190889371, 0.8571428571428571, 4, 0, 0.552, 3.017852315488105e-05], [1, 0, 0.6529284164859002, 0.0, 0, 0, 0.56, 0.0010419717440907023], [2, 0, 0.6550976138828634, 0.125, 2, 2, 0.56, 0.00304626447708912], [27, 9, 0.6572668112798264, 0.25, 53, 53, 0.56, 1.433830831427074e-06], [16, 2, 0.6594360086767896, 0.375, 43, 43, 0.56, 4.648965725605294e-06], [17, 4, 0.6616052060737527, 0.5, 42, 42, 0.56, 5.410095965080117e-06], [15, 1, 0.6637744034707158, 0.625, 41, 41, 0.56, 1.3920984719465585e-05], [13, 2, 0.665943600867679, 0.75, 29, 29, 0.56, 3.358605533459492e-05], [11, 3, 0.6681127982646421, 0.875, 25, 25, 0.56, 3.831742742817304e-05], [1, 0, 0.6702819956616052, 0.0, 0, 0, 0.568, 0.0014464694624057237], [2, 0, 0.6724511930585684, 0.5, 2, 0, 0.568, 0.00379275268491009], [1, 0, 0.6746203904555315, 0.0, 0, 0, 0.576, 0.0005873651434155784], [3, 0, 0.6767895878524945, 0.3333333333333333, 3, 0, 0.576, 0.0007145431338624223], [33, 11, 0.6789587852494577, 0.6666666666666666, 68, 68, 0.576, 1.6741607552245019e-06], [1, 0, 0.6811279826464208, 0.0, 0, 0, 0.584, 0.0005873651434155784], [2, 0, 0.6832971800433839, 0.3333333333333333, 2, 0, 0.584, 0.003864156105738551], [20, 1, 0.6854663774403471, 0.6666666666666666, 46, 46, 0.584, 1.6107577405464004e-05], [1, 0, 0.6876355748373102, 0.0, 0, 0, 0.592, 0.0005873651434155784], [2, 0, 0.6898047722342733, 0.3333333333333333, 2, 0, 0.592, 0.0025668647096606908], [29, 2, 0.6919739696312365, 0.6666666666666666, 17, 0, 0.592, 2.761589238821824e-05], [1, 0, 0.6941431670281996, 0.0, 0, 0, 0.6, 0.0005873651434155784], [5, 0, 0.6963123644251626, 0.3333333333333333, 5, 0, 0.6, 0.00011563062556032064], [24, 3, 0.6984815618221258, 0.6666666666666666, 3, 0, 0.6, 3.3863630259844855e-06], [1, 0, 0.7006507592190889, 0.0, 0, 0, 0.608, 0.0018184264027004949], [2, 0, 0.702819956616052, 0.16666666666666666, 2, 1, 0.608, 0.0029198827613013388], [86, 15, 0.7049891540130152, 0.3333333333333333, 15, 0, 0.608, 8.675332218985043e-07], [39, 4, 0.7071583514099783, 0.5, 12, 0, 0.608, 5.928893172872753e-06], [77, 5, 0.7093275488069414, 0.6666666666666666, 21, 1, 0.608, 3.77596007344467e-07], [19, 0, 0.7114967462039046, 0.8333333333333334, 33, 33, 0.608, 5.5392327869704294e-05], [1, 0, 0.7136659436008677, 0.0, 0, 0, 0.616, 0.0010419717440907023], [2, 0, 0.7158351409978309, 0.25, 2, 0, 0.616, 0.005280191760287808], [5, 0, 0.7180043383947939, 0.5, 2, 0, 0.616, 0.00032642388507290554], [4, 0, 0.720173535791757, 0.75, 1, 0, 0.616, 4.627357443026538e-05], [1, 0, 0.7223427331887202, 0.0, 0, 0, 0.624, 0.0014464694624057237], [2, 0, 0.7245119305856833, 0.5, 2, 0, 0.624, 0.0014633887090807123], [1, 0, 0.7266811279826464, 0.0, 0, 0, 0.632, 0.0014464694624057237], [2, 0, 0.7288503253796096, 0.2, 2, 0, 0.632, 0.0014633887090807123], [17, 3, 0.7310195227765727, 0.4, 2, 0, 0.632, 1.3048811812265158e-05], [17, 1, 0.7331887201735358, 0.6, 6, 0, 0.632, 1.3442235557005877e-05], [16, 0, 0.735357917570499, 0.8, 2, 0, 0.632, 4.14464815803928e-06], [1, 0, 0.737527114967462, 0.0, 0, 0, 0.64, 0.0014464694624057237], [3, 0, 0.7396963123644251, 0.2, 3, 0, 0.64, 0.0015523759932169624], [16, 2, 0.7418655097613883, 0.4, 6, 1, 0.64, 1.9703284900916953e-05], [46, 11, 0.7440347071583514, 0.6, 12, 2, 0.64, 8.21366062219741e-06], [14, 1, 0.7462039045553145, 0.8, 2, 0, 0.64, 3.8323075368215675e-05], [1, 0, 0.7483731019522777, 0.0, 0, 0, 0.648, 0.0005873651434155784], [3, 0, 0.7505422993492408, 0.3333333333333333, 3, 0, 0.648, 0.0007544076740890761], [27, 2, 0.7527114967462039, 0.6666666666666666, 8, 0, 0.648, 4.5627737377088426e-06], [1, 0, 0.754880694143167, 0.0, 0, 0, 0.656, 0.0005873651434155784], [3, 0, 0.7570498915401301, 0.25, 4, 2, 0.656, 0.00024385583013934492], [9, 0, 0.7592190889370932, 0.5, 8, 0, 0.656, 0.0002480070258273877], [9, 0, 0.7613882863340564, 0.75, 8, 1, 0.656, 7.255357335358975e-06], [1, 0, 0.7635574837310195, 0.0, 0, 0, 0.664, 0.0014464694624057237], [2, 0, 0.7657266811279827, 0.14285714285714285, 2, 0, 0.664, 0.004456017939034562], [26, 3, 0.7678958785249458, 0.2857142857142857, 7, 0, 0.664, 4.628598554435813e-06], [69, 5, 0.7700650759219089, 0.42857142857142855, 27, 2, 0.664, 5.898274533513278e-07], [18, 2, 0.7722342733188721, 0.5714285714285714, 9, 1, 0.664, 3.221189269998242e-06], [9, 2, 0.7744034707158352, 0.7142857142857143, 5, 0, 0.664, 2.754020677243896e-05], [20, 5, 0.7765726681127982, 0.8571428571428571, 5, 0, 0.664, 8.95351991609775e-06], [1, 0, 0.7787418655097614, 0.0, 0, 0, 0.672, 0.002494663296590083], [1, 0, 0.7809110629067245, 0.25, 2, 0, 0.672, 0.019989437384285044], [17, 1, 0.7830802603036876, 0.5, 7, 0, 0.672, 2.1030846140380717e-06], [4, 1, 0.7852494577006508, 0.75, 1, 0, 0.672, 0.00037973828151683075], [1, 0, 0.7874186550976139, 0.0, 0, 0, 0.68, 0.0005873651434155784], [2, 0, 0.789587852494577, 0.25, 2, 0, 0.68, 0.02090951534577155], [5, 0, 0.7917570498915402, 0.5, 3, 0, 0.68, 0.001479542286501637], [7, 1, 0.7939262472885033, 0.75, 3, 0, 0.68, 0.0006335820586642137], [1, 0, 0.7960954446854663, 0.0, 0, 0, 0.688, 0.0005873651434155784], [2, 0, 0.7982646420824295, 0.14285714285714285, 2, 0, 0.688, 0.0022730330033756186], [16, 1, 0.8004338394793926, 0.2857142857142857, 6, 0, 0.688, 9.723233717771061e-06], [12, 3, 0.8026030368763557, 0.42857142857142855, 4, 0, 0.688, 7.223208879980385e-05], [25, 2, 0.8047722342733189, 0.5714285714285714, 8, 0, 0.688, 1.4948570044719183e-05], [11, 1, 0.806941431670282, 0.7142857142857143, 1, 0, 0.688, 4.3493364300639865e-05], [9, 1, 0.8091106290672451, 0.8571428571428571, 4, 0, 0.688, 0.00013309860131663551], [1, 0, 0.8112798264642083, 0.0, 0, 0, 0.696, 0.0005873651434155784], [1, 0, 0.8134490238611713, 0.2, 2, 0, 0.696, 0.005904514662406043], [11, 2, 0.8156182212581344, 0.4, 6, 0, 0.696, 4.212739801049614e-05], [14, 4, 0.8177874186550976, 0.6, 6, 0, 0.696, 5.1439795786310214e-05], [8, 0, 0.8199566160520607, 0.8, 3, 0, 0.696, 0.00011680145621495477], [1, 0, 0.8221258134490239, 0.0, 0, 0, 0.704, 0.0010419717440907023], [2, 0, 0.824295010845987, 0.25, 3, 0, 0.704, 0.021197292496406187], [17, 3, 0.8264642082429501, 0.5, 6, 0, 0.704, 4.427457822559922e-08], [21, 3, 0.8286334056399133, 0.75, 12, 0, 0.704, 6.034250775777472e-11], [1, 0, 0.8308026030368764, 0.0, 0, 0, 0.712, 0.0014464694624057237], [2, 0, 0.8329718004338394, 0.5, 2, 0, 0.712, 0.0020457297030380566], [1, 0, 0.8351409978308026, 0.0, 0, 0, 0.72, 0.0010419717440907023], [1, 0, 0.8373101952277657, 0.125, 1, 0, 0.72, 0.0021661862415144756], [3, 0, 0.8394793926247288, 0.25, 2, 0, 0.72, 0.00048125656611538325], [8, 1, 0.841648590021692, 0.375, 4, 0, 0.72, 1.5142657337245774e-05], [11, 1, 0.8438177874186551, 0.5, 1, 0, 0.72, 1.5058612090092375e-05], [5, 0, 0.8459869848156182, 0.625, 1, 0, 0.72, 1.7521211615710613e-06], [19, 8, 0.8481561822125814, 0.75, 16, 2, 0.72, 2.0870609994112552e-06], [3, 0, 0.8503253796095445, 0.875, 1, 0, 0.72, 0.00027185444393746234], [1, 0, 0.8524945770065075, 0.0, 0, 0, 0.728, 0.0005873651434155784], [2, 0, 0.8546637744034707, 0.3333333333333333, 2, 0, 0.728, 0.0008312632615956971], [36, 8, 0.8568329718004338, 0.6666666666666666, 2, 0, 0.728, 1.326416453486703e-06], [1, 0, 0.8590021691973969, 0.0, 0, 0, 0.736, 0.0005873651434155784], [1, 0, 0.8611713665943601, 0.125, 1, 0, 0.736, 0.0010419717440907023], [6, 0, 0.8633405639913232, 0.25, 2, 0, 0.736, 0.00010656913431657373], [28, 4, 0.8655097613882863, 0.375, 4, 0, 0.736, 2.5499733155910156e-05], [8, 0, 0.8676789587852495, 0.5, 2, 0, 0.736, 1.682675948767923e-05], [6, 0, 0.8698481561822126, 0.625, 2, 0, 0.736, 6.131004944229914e-05], [14, 2, 0.8720173535791758, 0.75, 4, 0, 0.736, 0.00010212606785560661], [8, 1, 0.8741865509761388, 0.875, 2, 0, 0.736, 9.965638923717988e-06], [1, 0, 0.8763557483731019, 0.0, 0, 0, 0.744, 0.0005873651434155784], [3, 0, 0.8785249457700651, 0.3333333333333333, 3, 0, 0.744, 0.00454389281207626], [12, 2, 0.8806941431670282, 0.6666666666666666, 6, 0, 0.744, 0.0001391796627703335], [1, 0, 0.8828633405639913, 0.0, 0, 0, 0.752, 0.0005873651434155784], [2, 0, 0.8850325379609545, 0.25, 2, 0, 0.752, 0.002663531546934057], [25, 2, 0.8872017353579176, 0.5, 8, 0, 0.752, 3.199070213036026e-05], [18, 1, 0.8893709327548807, 0.75, 3, 0, 0.752, 9.77290993957464e-06], [1, 0, 0.8915401301518439, 0.0, 0, 0, 0.76, 0.0005873651434155784], [1, 0, 0.8937093275488069, 0.3333333333333333, 1, 0, 0.76, 0.0010419717440907023], [16, 1, 0.89587852494577, 0.6666666666666666, 10, 0, 0.76, 1.0530027941949585e-05], [1, 0, 0.8980477223427332, 0.0, 0, 0, 0.768, 0.0005873651434155784], [2, 0, 0.9002169197396963, 0.25, 2, 0, 0.768, 0.0038205650898055906], [25, 3, 0.9023861171366594, 0.5, 2, 0, 0.768, 1.687943424329306e-06], [12, 1, 0.9045553145336226, 0.75, 5, 0, 0.768, 0.00012094279864638284], [1, 0, 0.9067245119305857, 0.0, 0, 0, 0.776, 0.0005873651434155784], [1, 0, 0.9088937093275488, 0.2, 1, 0, 0.776, 0.0005873651434155784], [6, 1, 0.911062906724512, 0.4, 1, 0, 0.776, 3.361053914257726e-05], [2, 0, 0.913232104121475, 0.6, 1, 0, 0.776, 0.00020781581539892427], [12, 3, 0.9154013015184381, 0.8, 2, 0, 0.776, 1.9775579897795147e-05], [1, 0, 0.9175704989154013, 0.0, 0, 0, 0.784, 0.0005873651434155784], [2, 0, 0.9197396963123644, 0.25, 2, 0, 0.784, 0.0014633887090807123], [3, 0, 0.9219088937093276, 0.5, 1, 0, 0.784, 0.0010039705027317606], [19, 1, 0.9240780911062907, 0.75, 2, 0, 0.784, 4.81451427116021e-05], [1, 0, 0.9262472885032538, 0.0, 0, 0, 0.792, 0.0014464694624057237], [1, 0, 0.928416485900217, 0.3333333333333333, 1, 0, 0.792, 0.0005873651434155784], [8, 1, 0.93058568329718, 0.6666666666666666, 3, 0, 0.792, 0.00031661547625640906], [18, 2, 0.9327548806941431, 0.0, 9, 1, 0.8, 3.3176216287954474e-05], [10, 1, 0.9349240780911063, 0.5, 3, 0, 0.8, 9.537228246242764e-05], [9, 0, 0.9370932754880694, 0.0, 5, 0, 0.808, 3.647163004489233e-05], [33, 5, 0.9392624728850325, 0.0, 1, 0, 0.816, 4.419102370661721e-06], [16, 1, 0.9414316702819957, 0.0, 5, 0, 0.824, 9.444748865625848e-05], [8, 1, 0.9436008676789588, 0.0, 3, 0, 0.832, 8.27997224975899e-07], [9, 0, 0.9457700650759219, 0.0, 5, 0, 0.84, 0.0003320026239489827], [17, 2, 0.9479392624728851, 0.5, 7, 0, 0.84, 4.2598253837828565e-05], [14, 0, 0.9501084598698482, 0.0, 9, 0, 0.848, 7.720781515274695e-05], [13, 4, 0.9522776572668112, 0.0, 6, 0, 0.856, 7.408719114398655e-05], [9, 1, 0.9544468546637744, 0.0, 6, 1, 0.864, 7.491850701165181e-06], [22, 5, 0.9566160520607375, 0.0, 1, 0, 0.872, 3.1797638026515065e-05], [13, 0, 0.9587852494577006, 0.0, 7, 0, 0.88, 9.144698047950305e-05], [9, 2, 0.9609544468546638, 0.5, 1, 0, 0.88, 1.5583102373167132e-08], [21, 4, 0.9631236442516269, 0.0, 3, 0, 0.888, 2.0483850907959536e-11], [32, 9, 0.96529284164859, 0.3333333333333333, 11, 0, 0.888, 4.5829733334605154e-06], [6, 0, 0.9674620390455532, 0.6666666666666666, 5, 0, 0.888, 0.0009454664166475347], [12, 3, 0.9696312364425163, 0.0, 4, 0, 0.896, 8.790694092456192e-05], [30, 7, 0.9718004338394793, 0.0, 28, 0, 0.904, 2.2213689563279736e-05], [19, 4, 0.9739696312364425, 0.0, 9, 0, 0.912, 1.0851562604504928e-05], [9, 0, 0.9761388286334056, 0.0, 8, 2, 0.92, 2.86673623913635e-05], [4, 0, 0.9783080260303688, 0.0, 1, 1, 0.928, 0.0013704977675697517], [11, 1, 0.9804772234273319, 0.0, 6, 0, 0.936, 1.1500852432328875e-07], [60, 4, 0.982646420824295, 0.0, 12, 4, 0.944, 7.227229250982342e-07], [11, 1, 0.9848156182212582, 0.0, 5, 0, 0.952, 0.00010758201185594266], [13, 1, 0.9869848156182213, 0.0, 9, 0, 0.96, 7.415792202566266e-05], [4, 0, 0.9891540130151844, 0.5, 3, 0, 0.96, 0.0012167418830261708], [6, 0, 0.9913232104121475, 0.0, 2, 0, 0.968, 0.0004607986039241462], [15, 4, 0.9934924078091106, 0.0, 6, 0, 0.976, 0.0001085679960958843], [12, 3, 0.9956616052060737, 0.5, 5, 0, 0.976, 0.00017559285691496324], [6, 2, 0.9978308026030369, 0.0, 2, 0, 0.984, 1.716566513472624e-05]], "labels": [-1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, 1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, 1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, 1, -1, -1, -1, -1, 1, -1, -1, 1, -1, -1, -1, -1, -1, 1, -1, -1, -1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, 1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, 1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, 1, 1, 1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1]}