{"sentences": ["Reddit User Agreement", "Effective September 24, 2018.", "Reddit powers hundreds of thousands of distinct online communities.", "This User Agreement and your conduct make that possible.", "Hello, redditors and people of the Internet!", "This Reddit User Agreement (\"Terms\") applies to your access to and use of the websites, mobile apps, widgets, and other online products and services (collectively, the \"Services\") provided by Reddit, Inc. (\"Reddit,\" \"we,\" or \"us\").", "Remember Reddit is for fun and is intended to be a place for your entertainment, but we still need some basic rules.", "By accessing or using our Services, you agree to be bound by these Terms.", "If you do not agree to these Terms, you may not access or use our Services.", "Please take a look at Reddit’s Privacy Policy too—it explains how we collect, use, and share information about you when you access or use our Services.", "1.", "Your Access to the Services", "Children under the age of 13 are not allowed to create an account or otherwise use the Services.", "Additionally, if you are in the European Economic Area, you must be over the age required by the laws of your country to create an account or otherwise use the Services, or we need to have received verifiable consent from your parent or legal guardian.", "In addition, certain of our Services or portions of our Services require you to be older than 13 years of age, so please read all notices and any Additional Terms carefully when you access the Services.", "If you are accepting these Terms on behalf of another legal entity, including a business or a government, you represent that you have full legal authority to bind such entity to these terms.", "2.", "Your Use of the Services", "Reddit grants you a personal, non-transferable, non-exclusive, revocable, limited license to use and access the Services solely as permitted by these Terms.", "We reserve all rights not expressly granted to you by these Terms.", "Except as permitted through the Services or as otherwise permitted by us in writing, your license does not include the right to:", "license, sell, transfer, assign, distribute, host, or otherwise commercially exploit the Services or Content;", "modify, prepare derivative works of, disassemble, decompile, or reverse engineer any part of the Services or Content; or", "access the Services or Content in order to build a similar or competitive website, product, or service, except as permitted under the Reddit API Terms of Use.", "We reserve the right to modify, suspend, or discontinue the Services (in whole or in part) at any time, with or without notice to you.", "Any future release, update, or other addition to functionality of the Services will be subject to these Terms, which may be updated from time to time.", "You agree that we will not be liable to you or to any third party for any modification, suspension, or discontinuation of the Services or any part thereof.", "3.", "Your Reddit Account and Account Security", "To use certain features of our Services, you may be required to create a Reddit account (an \"Account\") and provide us with a username, password, and certain other information about yourself as set forth in the Privacy Policy.", "You are solely responsible for the information associated with Your Account and anything that happens related to Your Account.", "You must maintain the security of your Account and promptly notify Reddit if you discover or suspect that someone has accessed your Account without your permission.", "We recommend that you use a strong password that is used only with the Services.", "You will not license, sell, or transfer your Account without our prior written approval.", "4.", "Your Content", "The Services may contain information, text, links, graphics, photos, videos, or other materials (“Content”), including Content created with or submitted to the Services by you or through your Account (“Your Content”).", "We take no responsibility for and we do not expressly or implicitly endorse any of Your Content.", "By submitting Your Content to the Services, you represent and warrant that you have all rights, power, and authority necessary to grant the rights to Your Content contained within these Terms.", "Because you alone are responsible for Your Content, you may expose yourself to liability if you post or share Content without all necessary rights.", "You retain any ownership rights you have in Your Content, but you grant Reddit the following license to use that Content:", "When Your Content is created with or submitted to the Services, you grant us a worldwide, royalty-free, perpetual, irrevocable, non-exclusive, transferable, and sublicensable license to use, copy, modify, adapt, prepare derivative works from, distribute, perform, and display Your Content and any name, username, voice, or likeness provided in connection with Your Content in all media formats and channels now known or later developed.", "This license includes the right for us to make Your Content available for syndication, broadcast, distribution, or publication by other companies, organizations, or individuals who partner with Reddit.", "You also agree that we may remove metadata associated with Your Content, and you irrevocably waive any claims and assertions of moral rights or attribution with respect to Your Content.", "Any ideas, suggestions, and feedback about Reddit or our Services that you provide to us are entirely voluntary, and you agree that Reddit may use such ideas, suggestions, and feedback without compensation or obligation to you.", "Although we have no obligation to screen, edit, or monitor Your Content, we may, in our sole discretion, delete or remove Your Content at any time and for any reason, including for a violation of these Terms, a violation of our Content Policy, or if you otherwise create liability for us.", "5.", "Third-Party Content, Advertisements and Promotions", "The Services may contain links to third-party websites, products, or services, which may be posted by advertisers, our affiliates, our partners, or other users (“Third-Party Content”).", "Third-Party Content is not under our control, and we are not responsible for any of their websites, products, or services.", "Your use of Third-Party Content is at your own risk and you should make any investigation you feel necessary before proceeding with any transaction in connection with such Third-Party Content.", "The Services may also contain sponsored Third-Party Content or advertisements.", "The type, degree, and targeting of advertisements are subject to change, and you acknowledge and agree that we may place advertisements in connection with the display of any Content or information on the Services, including Your Content.", "If you choose to use the Services to conduct a promotion, including a contest or sweepstakes, you alone are responsible for conducting the promotion in compliance with all applicable laws and regulations.", "The terms of your promotion must specifically state that the promotion is not sponsored by, endorsed by, or associated with Reddit and the rules for your promotion must require each entrant or participant to release Reddit from any liability related to the promotion.", "6.", "Things You Cannot Do", "When accessing or using the Services, you must respect others and their rights, including by following these Terms and the Content Policy, so that we all may continue to use and enjoy the Services.", "We support the responsible reporting of security vulnerabilities.", "To report a security issue, please send an email to security@reddit.com.", "When accessing or using our Services, you will not:", "Create or submit Content that violates our Content Policy or attempt to circumvent any content-filtering techniques we use;", "Use the Services to violate applicable law or infringe any person or entity's intellectual property or any other proprietary rights;", "Attempt to gain unauthorized access to another user’s Account or to the Services (or to other computer systems or networks connected to or used together with the Services);", "Upload, transmit, or distribute to or through the Services any computer viruses, worms, or other software intended to interfere with the intended operation of a computer system or data;", "Use the Services to harvest, collect, gather or assemble information or data regarding the Services or users of the Services except as permitted in these Terms or in a separate agreement with Reddit;", "Use the Services in any manner that could interfere with, disrupt, negatively affect, or inhibit other users from fully enjoying the Services or that could damage, disable, overburden, or impair the functioning of the Services in any manner;", "Intentionally negate any user's actions to delete or edit their Content on the Services; or", "Access, query, or search the Services with any automated system, other than through our published interfaces and pursuant to their applicable terms.", "However, we conditionally grant permission to crawl the Services for the sole purpose of and solely to the extent necessary for creating publicly available searchable indices of the materials subject to the parameters set forth in our robots.txt file.", "7.", "Moderators", "Moderating a subreddit is an unofficial, voluntary position that may be available to users of the Services.", "We are not responsible for actions taken by the moderators.", "We recognize that moderation can take some work, so we may change the features or abilities associated with moderating from time to time without prior notice.", "We reserve the right to revoke or limit a user’s ability to moderate at any time and for any reason or no reason, including for a breach of these Terms.", "If you choose to moderate a subreddit:", "You agree to follow the Moderator Guidelines for Healthy Communities;", "You agree that when you receive reports related to your community, that you will take action to moderate by removing content and/or escalating to the admins for review;", "You may not represent that you are authorized to act on behalf of Reddit, Inc.;", "You may not enter into any agreement with a third party on behalf of Reddit, or any subreddits that you moderate, without our written approval;", "You may not perform moderation actions in return for any form of compensation or favor from third parties;", "If you have access to non-public information as a result of moderating a subreddit, you will use such information only in connection with your performance as a moderator; and", "You may create and enforce rules for the subreddits you moderate, provided that such rules do not conflict with these Terms, our Content Policy, and the Moderator Guidelines for Healthy Communities.", "Reddit reserves the right, but has no obligation, to overturn any action or decision of a moderator if Reddit believes that such action or decision is not in the interest of Reddit or the Reddit community.", "8.", "Copyright, the DMCA & Takedowns", "Reddit respects the intellectual property of others and requires that users of our Services do the same.", "We have a policy that includes the removal of any infringing materials from the Services and for the termination, in appropriate circumstances, of users of our Services who are repeat infringers.", "If you believe that anything on our Services infringes a copyright that you own or control, you may notify Reddit’s Designated Agent by filling out our DMCA Report Form or by contacting:", "Copyright Agent", "Reddit, Inc.", "420 Taylor St.", "San Francisco, CA 94102", "copyright@reddit.com", "Also, please note that if you knowingly misrepresent that any activity or material on our Service is infringing, you may be liable to Reddit for certain costs and damages.", "If we remove Your Content in response to a copyright or trademark notice, we will notify you via Reddit’s private messaging system.", "If you believe Your Content was wrongly removed due to a mistake or misidentification, you can send a counter notification to our Copyright Agent (contact information provided above).", "Please see 17 U.S.C.", "§512(g)(3) for the requirements of a proper counter notification.", "9.", "Reddit Premium, Virtual Goods and Payment Information", "There are no fees for use of many aspects of the Services.", "However, premium features, including Reddit Premium and Virtual Goods, which include Coins, may be available for purchase on certain of our Services.", "In addition to these terms, by purchasing or using Reddit Premium or our Virtual Goods, you further agree to the Reddit Premium and Virtual Goods Agreement.", "Reddit may change the fees or benefits associated with the premium features from time to time with reasonable advance notice; provided, however, that no advance notice will be required for temporary promotions, including temporary reductions in the fees associated with the premium features.", "You may submit your debit card, credit card, or other payment information (\"Payment Information\") via our Services to purchase premium features or other paid products or services.", "We use third-party service providers to process your Payment Information.", "If you submit your Payment Information, you agree to pay all costs that you incur, and you give us permission to charge you when payment is due for an amount that includes these costs and any applicable taxes and fees.", "10.", "Indemnity", "Except to the extent prohibited by law, you agree to defend, indemnify, and hold us, our licensors, our third party service providers and our officers, employees, licensors, and agents (the “Reddit Entities”) harmless, including costs and attorneys’ fees, from any claim or demand made by any third party due to or arising out of (a) your use of the Services, (b) your violation of these Terms, (c) your violation of applicable laws or regulations, or (d) Your Content.", "We reserve the right to control the defense of any matter for which you are required to indemnify us, and you agree to cooperate with our defense of these claims.", "11.", "Disclaimers", "THE SERVICES ARE PROVIDED \"AS IS\" AND \"AS AVAILABLE\" WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.", "REDDIT, ITS LICENSORS, AND ITS THIRD PARTY SERVICE PROVIDERS DO NOT WARRANT THAT THE SERVICES ARE ACCURATE, COMPLETE, RELIABLE, CURRENT, OR ERROR FREE.", "REDDIT DOES NOT CONTROL, ENDORSE, OR TAKE RESPONSIBILITY FOR ANY CONTENT AVAILABLE ON OR LINKED TO THE SERVICES OR THE ACTIONS OF ANY THIRD PARTY OR USER, INCLUDING MODERATORS.", "WHILE REDDIT ATTEMPTS TO MAKE YOUR ACCESS TO AND USE OF OUR SERVICES SAFE, WE DO NOT REPRESENT OR WARRANT THAT OUR SERVICES OR SERVERS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS.", "12.", "Limitation of Liability", "IN NO EVENT AND UNDER NO THEORY OF LIABILITY, INCLUDING CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, WARRANTY, OR OTHERWISE, WILL THE REDDIT ENTITIES BE LIABLE TO YOU FOR ANY INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE DAMAGES, OR LOST PROFITS ARISING FROM OR RELATING TO THESE TERMS OR THE SERVICES, INCLUDING THOSE ARISING FROM OR RELATING TO CONTENT MADE AVAILABLE ON THE SERVICES THAT IS ALLEGED TO BE DEFAMATORY, OFFENSIVE, OR ILLEGAL.", "ACCESS TO, AND USE OF, THE SERVICES IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR DEVICE OR COMPUTER SYSTEM, OR LOSS OF DATA RESULTING THEREFROM.", "IN NO EVENT WILL THE AGGREGATE LIABILITY OF THE REDDIT ENTITIES EXCEED THE GREATER OF ONE HUNDRED U.S.", "DOLLARS ($100) OR ANY AMOUNT YOU PAID REDDIT IN THE PREVIOUS SIX MONTHS FOR THE SERVICES GIVING RISE TO THE CLAIM.", "THE LIMITATIONS OF THIS SECTION WILL APPLY TO ANY THEORY OF LIABILITY, INCLUDING THOSE BASED ON WARRANTY, CONTRACT, STATUTE, TORT (INCLUDING NEGLIGENCE) OR OTHERWISE, AND EVEN IF THE REDDIT ENTITIES HAVE BEEN ADVISED OF THE POSSIBILITY OF ANY SUCH DAMAGE, AND EVEN IF ANY REMEDY SET FORTH HEREIN IS FOUND TO HAVE FAILED ITS ESSENTIAL PURPOSE.", "THE FOREGOING LIMITATION OF LIABILITY WILL APPLY TO THE FULLEST EXTENT PERMITTED BY LAW IN THE APPLICABLE JURISDICTION.", "13.", "Governing Law and Venue", "We want you to enjoy Reddit, so if you have an issue or dispute, you agree to raise it and try to resolve it with us informally.", "You can contact us with feedback and concerns here or by emailing us at contact@reddit.com.", "Except for the government entities listed below: any claims arising out of or relating to these Terms or the Services will be governed by the laws of California, other than its conflict of laws rules; all disputes related to these Terms or the Services will be brought solely in the federal or state courts located in San Francisco, California; and you consent to personal jurisdiction in these courts.", "Government Entities", "If you are a U.S. city, county, or state government entity, then this Section 13 does not apply to you.", "If you are a U.S. federal government entity: any claims arising out of or relating to these Terms or the Services will be governed by the laws of the United States of America without reference to conflict of laws.", "To the extent permitted by federal law, the laws of California (other than its conflict of law rules) will apply in the absence of applicable federal law.", "All disputes related to these Terms or the Services will be brought solely in the federal or state courts located in San Francisco, California.", "14.", "Changes to these Terms", "We may make changes to these Terms from time to time.", "If we make changes, we will post the amended Terms to our Services and update the Effective Date above.", "If the changes, in our sole discretion, are material, we may also notify you by sending an email to the address associated with your Account (if you have chosen to provide an email address) or by otherwise providing notice through our Services.", "By continuing to access or use the Services on or after the Effective Date of the revised Terms, you agree to be bound by the revised Terms.", "If you do not agree to the revised Terms, you must stop accessing and using our Services before the changes become effective.", "15.", "Additional Terms", "Because we offer a variety of Services, you may be asked to agree to additional terms before using a specific product or service offered by Reddit (“Additional Terms”).", "To the extent any Additional Terms conflict with these Terms, the Additional Terms govern with respect to your use of the corresponding Service.", "If you use Reddit Premium or Virtual Goods, you must also agree to our Terms for Reddit Premium and Virtual Goods.", "If you use the self-service platform for advertising, you must also agree to our Terms for Self-Service Advertising.", "If you use our public API, you must also agree to our Reddit API Terms of Use.", "If you use RedditGifts, you must agree to the RedditGifts Terms of Service.", "16.", "Termination", "You may terminate these Terms at any time and for any reason by deleting your Account and discontinuing your use of all Services.", "If you stop using the Services without deactivating your Accounts, your Accounts may be deactivated due to prolonged inactivity.", "We may suspend or terminate your Accounts, status as a moderator, or ability to access or use the Services at any time for any or no reason, including for a violation of these Terms or our Content Policy.", "The following sections will survive any termination of these Terms or of your Accounts: 4 (Your Content), 6 (Things You Cannot Do), 10 (Indemnity), 11 (Disclaimers), 12 (Limitation of Liability), 13 (Governing Law and Venue), 16 (Termination), and 17 (Miscellaneous).", "17.", "Miscellaneous", "These Terms constitute the entire agreement between you and us regarding your access to and use of the Services.", "Our failure to exercise or enforce any right or provision of these Terms will not operate as a waiver of such right or provision.", "If any provision of these Terms is, for any reason, held to be illegal, invalid or unenforceable, the rest of the Terms will remain in effect.", "You may not assign or transfer any of your rights or obligations under these Terms without our consent.", "We may freely assign these Terms."], "features": [[3, 0, 0.0, 0.0, 3, 0, 0.0, 0.00604777020528614], [4, 1, 0.006060606060606061, 0.25, 2, 0, 0.0, 0.0003350899155728382], [7, 0, 0.012121212121212121, 0.5, 1, 0, 0.0, 0.00010138291522336247], [4, 0, 0.01818181818181818, 0.75, 3, 0, 0.0, 2.6369589626441282e-06], [3, 1, 0.024242424242424242, 0.0, 2, 0, 0.018867924528301886, 0.00026495516271577796], [18, 7, 0.030303030303030304, 0.5, 9, 0, 0.018867924528301886, 1.871122785254699e-12], [8, 1, 0.03636363636363636, 0.0, 2, 0, 0.03773584905660377, 0.00012123642042613533], [5, 1, 0.04242424242424243, 0.3333333333333333, 3, 0, 0.03773584905660377, 0.0008471582060127745], [4, 1, 0.048484848484848485, 0.6666666666666666, 3, 0, 0.03773584905660377, 0.0014627285844086395], [10, 2, 0.05454545454545454, 0.0, 5, 0, 0.05660377358490566, 0.0002256297326879035], [1, 0, 0.06060606060606061, 0.0, 0, 0, 0.07547169811320754, 0.001526141737242881], [2, 0, 0.06666666666666667, 0.25, 3, 0, 0.07547169811320754, 0.02388377050619588], [7, 0, 0.07272727272727272, 0.5, 2, 0, 0.07547169811320754, 0.0004604677417811775], [17, 3, 0.07878787878787878, 0.75, 5, 0, 0.07547169811320754, 6.6129278733643966e-06], [16, 2, 0.08484848484848485, 0.0, 6, 0, 0.09433962264150944, 8.918159775425993e-05], [15, 2, 0.09090909090909091, 0.0, 2, 0, 0.11320754716981132, 8.941983878935392e-05], [1, 0, 0.09696969696969697, 0.0, 0, 0, 0.1320754716981132, 0.001526141737242881], [1, 0, 0.10303030303030303, 0.25, 3, 0, 0.1320754716981132, 0.022553487676018655], [13, 4, 0.10909090909090909, 0.5, 3, 0, 0.1320754716981132, 0.00011909733651804312], [5, 0, 0.11515151515151516, 0.75, 2, 0, 0.1320754716981132, 0.0008080864498575833], [6, 1, 0.12121212121212122, 0.0, 2, 0, 0.1509433962264151, 1.6251767603322836e-09], [10, 6, 0.12727272727272726, 0.0, 2, 0, 0.16981132075471697, 0.0002265825090826717], [11, 4, 0.13333333333333333, 0.16666666666666666, 2, 0, 0.16981132075471697, 1.5380706460335893e-06], [14, 3, 0.1393939393939394, 0.3333333333333333, 6, 1, 0.16981132075471697, 3.397131200694241e-09], [8, 3, 0.14545454545454545, 0.5, 2, 0, 0.16981132075471697, 2.3950140054182055e-08], [11, 3, 0.15151515151515152, 0.6666666666666666, 3, 0, 0.16981132075471697, 9.530568193980233e-05], [9, 2, 0.15757575757575756, 0.8333333333333334, 2, 0, 0.16981132075471697, 2.9060876103653698e-05], [1, 0, 0.16363636363636364, 0.0, 0, 0, 0.18867924528301888, 0.001526141737242881], [4, 0, 0.1696969696969697, 0.3333333333333333, 5, 0, 0.18867924528301888, 0.001301094547297936], [14, 3, 0.17575757575757575, 0.6666666666666666, 6, 0, 0.18867924528301888, 4.185383947128732e-05], [6, 0, 0.18181818181818182, 0.0, 5, 0, 0.20754716981132076, 0.00034165713703225554], [11, 0, 0.18787878787878787, 0.3333333333333333, 4, 0, 0.20754716981132076, 2.9866070713831192e-05], [4, 0, 0.19393939393939394, 0.6666666666666666, 2, 0, 0.20754716981132076, 0.0014162028545905802], [7, 2, 0.2, 0.0, 2, 0, 0.22641509433962265, 7.7810652653341e-05], [1, 0, 0.20606060606060606, 0.0, 0, 0, 0.24528301886792453, 0.0026379269766688574], [1, 0, 0.21212121212121213, 0.25, 2, 0, 0.24528301886792453, 0.021988560919961375], [16, 7, 0.21818181818181817, 0.5, 8, 0, 0.24528301886792453, 8.664220272516862e-05], [5, 0, 0.22424242424242424, 0.75, 3, 0, 0.24528301886792453, 0.0008938305887947951], [13, 3, 0.23030303030303031, 0.0, 7, 0, 0.2641509433962264, 0.0001191924695950063], [8, 1, 0.23636363636363636, 0.5, 4, 0, 0.2641509433962264, 0.00012751418226358954], [8, 1, 0.24242424242424243, 0.0, 5, 0, 0.2830188679245283, 0.00034386609239245297], [33, 17, 0.24848484848484848, 0.0, 8, 0, 0.3018867924528302, 1.401415820299204e-06], [13, 5, 0.2545454545454545, 0.3333333333333333, 4, 0, 0.3018867924528302, 0.00012403090910085418], [13, 1, 0.2606060606060606, 0.6666666666666666, 5, 0, 0.3018867924528302, 0.00013029736449349079], [14, 5, 0.26666666666666666, 0.0, 4, 0, 0.32075471698113206, 4.822755549106162e-10], [20, 8, 0.2727272727272727, 0.0, 8, 0, 0.33962264150943394, 1.485375024790752e-10], [1, 0, 0.2787878787878788, 0.0, 0, 0, 0.3584905660377358, 0.001526141737242881], [4, 1, 0.28484848484848485, 0.2, 4, 0, 0.3584905660377358, 0.0005116151945795039], [13, 6, 0.2909090909090909, 0.4, 4, 0, 0.3584905660377358, 0.00015588048191948504], [7, 3, 0.296969696969697, 0.6, 2, 0, 0.3584905660377358, 0.0005231593131980784], [11, 0, 0.30303030303030304, 0.8, 5, 0, 0.3584905660377358, 0.00022176464574215162], [5, 0, 0.3090909090909091, 0.0, 4, 0, 0.37735849056603776, 0.00039413049117808667], [17, 4, 0.3151515151515151, 0.5, 5, 0, 0.37735849056603776, 7.667446356930641e-05], [14, 2, 0.3212121212121212, 0.0, 2, 0, 0.39622641509433965, 1.3866802441145806e-05], [18, 2, 0.32727272727272727, 0.5, 3, 0, 0.39622641509433965, 2.443405619489881e-05], [1, 0, 0.3333333333333333, 0.0, 0, 0, 0.41509433962264153, 0.0026379269766688574], [1, 0, 0.3393939393939394, 0.2, 4, 0, 0.41509433962264153, 0.0026379269766688574], [11, 3, 0.34545454545454546, 0.4, 6, 0, 0.41509433962264153, 0.00019527164926208743], [5, 0, 0.3515151515151515, 0.6, 1, 0, 0.41509433962264153, 0.00016091251275732838], [6, 1, 0.3575757575757576, 0.8, 1, 0, 0.41509433962264153, 4.9526745869507263e-05], [2, 1, 0.36363636363636365, 0.0, 2, 0, 0.4339622641509434, 0.0004615975996291201], [10, 0, 0.3696969696969697, 0.0, 4, 0, 0.4528301886792453, 1.890219790953427e-09], [11, 0, 0.37575757575757573, 0.06666666666666667, 2, 0, 0.4528301886792453, 7.951205654962053e-05], [12, 0, 0.38181818181818183, 0.13333333333333333, 4, 0, 0.4528301886792453, 0.0001566214908211578], [15, 4, 0.3878787878787879, 0.2, 2, 0, 0.4528301886792453, 1.6169797563446524e-05], [15, 2, 0.3939393939393939, 0.26666666666666666, 6, 0, 0.4528301886792453, 9.216662790496134e-05], [18, 6, 0.4, 0.3333333333333333, 4, 0, 0.4528301886792453, 9.498639780725967e-06], [8, 0, 0.40606060606060607, 0.4, 3, 0, 0.4528301886792453, 5.5460190898156665e-06], [11, 3, 0.4121212121212121, 0.4666666666666667, 2, 0, 0.4528301886792453, 0.00020808119968600226], [19, 1, 0.41818181818181815, 0.5333333333333333, 2, 0, 0.4528301886792453, 4.710325609439057e-06], [1, 0, 0.42424242424242425, 0.6, 0, 0, 0.4528301886792453, 0.001526141737242881], [1, 0, 0.4303030303030303, 0.6666666666666666, 1, 0, 0.4528301886792453, 0.0035933159452737314], [7, 1, 0.43636363636363634, 0.7333333333333333, 2, 0, 0.4528301886792453, 0.0004671700237312561], [3, 0, 0.44242424242424244, 0.8, 1, 0, 0.4528301886792453, 0.0005434108909161291], [11, 1, 0.4484848484848485, 0.8666666666666667, 1, 0, 0.4528301886792453, 6.052292039033348e-05], [12, 1, 0.45454545454545453, 0.9333333333333333, 2, 0, 0.4528301886792453, 0.0001399621909400475], [3, 0, 0.46060606060606063, 0.0, 1, 0, 0.4716981132075472, 0.0009440809927816538], [6, 0, 0.4666666666666667, 0.0, 5, 0, 0.49056603773584906, 0.0001430095442006598], [13, 1, 0.4727272727272727, 0.125, 1, 0, 0.49056603773584906, 9.156410419834916e-06], [5, 1, 0.47878787878787876, 0.25, 3, 0, 0.49056603773584906, 3.9423230543351864e-05], [9, 2, 0.48484848484848486, 0.375, 2, 0, 0.49056603773584906, 4.1261712185309414e-05], [8, 0, 0.4909090909090909, 0.5, 1, 0, 0.49056603773584906, 2.3990983936055735e-05], [10, 1, 0.49696969696969695, 0.625, 1, 0, 0.49056603773584906, 5.237373795664669e-07], [15, 3, 0.503030303030303, 0.75, 8, 0, 0.49056603773584906, 1.806092692036161e-05], [15, 2, 0.509090909090909, 0.875, 4, 0, 0.49056603773584906, 3.132884577807301e-05], [1, 0, 0.5151515151515151, 0.0, 0, 0, 0.5094339622641509, 0.001526141737242881], [4, 1, 0.5212121212121212, 0.2, 3, 1, 0.5094339622641509, 0.0003795100553836004], [7, 0, 0.5272727272727272, 0.4, 2, 0, 0.5094339622641509, 3.974873230768835e-09], [12, 2, 0.5333333333333333, 0.6, 3, 0, 0.5094339622641509, 1.2698084540979707e-05], [13, 1, 0.5393939393939394, 0.8, 8, 1, 0.5094339622641509, 9.046896162465417e-06], [2, 0, 0.5454545454545454, 0.0, 2, 0, 0.5283018867924528, 0.004485721444421378], [1, 1, 0.5515151515151515, 0.2, 2, 0, 0.5283018867924528, 0.02047705778052158], [3, 0, 0.5575757575757576, 0.4, 2, 0, 0.5283018867924528, 0.0006782852165523916], [4, 1, 0.5636363636363636, 0.6, 3, 1, 0.5283018867924528, 0.0003549748091326808], [1, 0, 0.5696969696969697, 0.8, 0, 0, 0.5283018867924528, 0.001526141737242881], [11, 2, 0.5757575757575758, 0.0, 3, 0, 0.5471698113207547, 2.244591529842675e-05], [11, 1, 0.5818181818181818, 0.0, 4, 0, 0.5660377358490566, 4.363655978881907e-05], [14, 1, 0.5878787878787879, 0.25, 5, 0, 0.5660377358490566, 1.9569422956823506e-07], [2, 0, 0.593939393939394, 0.5, 2, 1, 0.5660377358490566, 0.0027239137190007913], [5, 0, 0.6, 0.75, 0, 0, 0.5660377358490566, 0.00018829973521328148], [1, 0, 0.6060606060606061, 0.0, 0, 0, 0.5849056603773585, 0.001526141737242881], [6, 1, 0.6121212121212121, 0.2, 6, 0, 0.5849056603773585, 0.00043987827214719464], [3, 0, 0.6181818181818182, 0.4, 2, 0, 0.5849056603773585, 0.005524292506494034], [11, 4, 0.6242424242424243, 0.6, 7, 0, 0.5849056603773585, 0.0001864013357749769], [13, 2, 0.6303030303030303, 0.8, 10, 0, 0.5849056603773585, 4.669371305659018e-05], [23, 3, 0.6363636363636364, 0.0, 1, 0, 0.6037735849056604, 1.3300953630545246e-05], [16, 2, 0.6424242424242425, 0.0, 4, 0, 0.6226415094339622, 8.981595958841405e-05], [6, 0, 0.6484848484848484, 0.3333333333333333, 3, 0, 0.6226415094339622, 0.00043476531702654785], [18, 2, 0.6545454545454545, 0.6666666666666666, 3, 0, 0.6226415094339622, 1.7258979585622443e-05], [1, 0, 0.6606060606060606, 0.0, 0, 0, 0.6415094339622641, 0.0026379269766688574], [1, 0, 0.6666666666666666, 0.25, 1, 0, 0.6415094339622641, 0.0026379269766688574], [36, 13, 0.6727272727272727, 0.5, 7, 0, 0.6415094339622641, 1.696651256767372e-05], [10, 1, 0.6787878787878788, 0.75, 1, 0, 0.6415094339622641, 4.458591465166942e-05], [1, 0, 0.6848484848484848, 0.0, 0, 0, 0.660377358490566, 0.0026379269766688574], [1, 0, 0.6909090909090909, 0.16666666666666666, 1, 0, 0.660377358490566, 0.0026379269766688574], [14, 6, 0.696969696969697, 0.3333333333333333, 34, 34, 0.660377358490566, 7.961465270331852e-06], [13, 6, 0.703030303030303, 0.5, 23, 23, 0.660377358490566, 1.7848183586623005e-05], [12, 3, 0.7090909090909091, 0.6666666666666666, 29, 29, 0.660377358490566, 4.051535939119071e-05], [14, 1, 0.7151515151515152, 0.8333333333333334, 33, 33, 0.660377358490566, 9.03150260683257e-06], [1, 0, 0.7212121212121212, 0.0, 0, 0, 0.6792452830188679, 0.0026379269766688574], [2, 0, 0.7272727272727273, 0.125, 2, 0, 0.6792452830188679, 0.006718316176100263], [36, 16, 0.7333333333333333, 0.25, 71, 71, 0.6792452830188679, 2.0382726651823203e-06], [14, 4, 0.7393939393939394, 0.375, 35, 35, 0.6792452830188679, 9.235544395307329e-06], [8, 0, 0.7454545454545455, 0.5, 18, 18, 0.6792452830188679, 3.749389703428139e-07], [11, 0, 0.7515151515151515, 0.625, 20, 20, 0.6792452830188679, 2.185354933217892e-05], [24, 6, 0.7575757575757576, 0.75, 56, 56, 0.6792452830188679, 6.680331220313257e-06], [10, 0, 0.7636363636363637, 0.875, 18, 18, 0.6792452830188679, 3.9584398269782665e-05], [1, 0, 0.7696969696969697, 0.0, 0, 0, 0.6981132075471698, 0.0052254437022638935], [3, 0, 0.7757575757575758, 0.25, 3, 0, 0.6981132075471698, 0.0009481763968152001], [8, 2, 0.7818181818181819, 0.5, 2, 0, 0.6981132075471698, 2.386583574820754e-05], [5, 0, 0.7878787878787878, 0.75, 1, 0, 0.6981132075471698, 6.301229510212575e-05], [31, 2, 0.793939393939394, 0.0, 9, 0, 0.7169811320754716, 4.117734813916689e-06], [2, 0, 0.8, 0.0, 2, 0, 0.7358490566037735, 0.005598126801581151], [8, 3, 0.806060606060606, 0.0, 3, 1, 0.7547169811320755, 1.7087121373174885e-08], [16, 0, 0.8121212121212121, 0.0, 7, 1, 0.7735849056603774, 3.11887772058249e-05], [14, 1, 0.8181818181818182, 0.3333333333333333, 2, 0, 0.7735849056603774, 4.654530676239621e-05], [13, 1, 0.8242424242424242, 0.6666666666666666, 6, 0, 0.7735849056603774, 3.3039759754840055e-05], [1, 0, 0.8303030303030303, 0.0, 0, 0, 0.7924528301886793, 0.001526141737242881], [1, 0, 0.8363636363636363, 0.14285714285714285, 2, 0, 0.7924528301886793, 0.0200968853625024], [4, 0, 0.8424242424242424, 0.2857142857142857, 2, 0, 0.7924528301886793, 0.0010046839025282524], [8, 1, 0.8484848484848485, 0.42857142857142855, 5, 0, 0.7924528301886793, 9.386320424394944e-07], [15, 3, 0.8545454545454545, 0.5714285714285714, 3, 0, 0.7924528301886793, 0.0001003929810928935], [11, 1, 0.8606060606060606, 0.7142857142857143, 6, 0, 0.7924528301886793, 0.00022199266012224675], [7, 1, 0.8666666666666667, 0.8571428571428571, 3, 0, 0.7924528301886793, 9.099730645332778e-05], [1, 0, 0.8727272727272727, 0.0, 0, 0, 0.8113207547169812, 0.001526141737242881], [2, 0, 0.8787878787878788, 0.25, 2, 0, 0.8113207547169812, 0.021192121253464345], [14, 1, 0.8848484848484849, 0.5, 5, 0, 0.8113207547169812, 0.0001269949547412863], [10, 1, 0.8909090909090909, 0.75, 7, 0, 0.8113207547169812, 7.236858561643116e-05], [10, 1, 0.896969696969697, 0.0, 10, 0, 0.8301886792452831, 8.283395876886356e-05], [7, 1, 0.9030303030303031, 0.0, 4, 0, 0.8490566037735849, 9.712339863838723e-05], [6, 1, 0.9090909090909091, 0.0, 6, 2, 0.8679245283018868, 7.821355818052201e-07], [5, 1, 0.9151515151515152, 0.0, 5, 0, 0.8867924528301887, 0.00043420537217271046], [1, 0, 0.9212121212121213, 0.0, 0, 0, 0.9056603773584906, 0.0026379269766688574], [1, 0, 0.9272727272727272, 0.25, 1, 0, 0.9056603773584906, 0.004791087927031642], [8, 0, 0.9333333333333333, 0.5, 4, 0, 0.9056603773584906, 0.0003525153622507769], [9, 1, 0.9393939393939394, 0.75, 4, 0, 0.9056603773584906, 2.4120506816909766e-05], [15, 3, 0.9454545454545454, 0.0, 6, 0, 0.9245283018867925, 4.6574814446030974e-05], [24, 7, 0.9515151515151515, 0.0, 18, 0, 0.9433962264150944, 5.0723251735441275e-06], [1, 0, 0.9575757575757575, 0.0, 0, 0, 0.9622641509433962, 0.0035933159452737314], [1, 0, 0.9636363636363636, 0.14285714285714285, 1, 0, 0.9622641509433962, 0.0026379269766688574], [6, 0, 0.9696969696969697, 0.2857142857142857, 3, 0, 0.9622641509433962, 0.0006265964170867587], [8, 0, 0.9757575757575757, 0.42857142857142855, 2, 0, 0.9622641509433962, 6.183192393830053e-05], [11, 4, 0.9818181818181818, 0.5714285714285714, 3, 0, 0.9622641509433962, 1.2945315754629526e-05], [6, 0, 0.9878787878787879, 0.7142857142857143, 2, 0, 0.9622641509433962, 0.0001134545110006453], [3, 0, 0.9939393939393939, 0.8571428571428571, 2, 0, 0.9622641509433962, 0.006136524776334727]], "labels": [-1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, 1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, 1, 1, 1, -1, 1, -1, -1, -1, 1, -1, 1, -1, 1, -1, 1, 1, 1, -1, -1, -1, -1, -1, -1, 1, 1, -1, -1, -1, -1, -1, -1, 1, 1, -1, 1, 1, -1, 1, -1, -1, -1, -1, -1, -1, 1, 1, 1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, -1, 1, 1]}